{
	"emilyQuest": {
		"EmilyMeet": "In the corner of the street you spot a young girl dressed in ragged clothes. Poverty is widespread around the kingdom, but seeing it first hand still raises some discomfort in you. It does not look like there's many people around, nor anyone paying attention to you, so you decide to start a conversation with her. \n\n[color=yellow]— I'm sorry if I bother you, $sir, but I'm very hungry! Could you spare some food?[/color]",
        "EmilyFeed": "After going through your belongings you finally find some bread and meat you had leftover from breakfast, which you pass to her. Emily takes your offering with an excited look and quickly expresses her gratitude. While she eats, you decide to spend some time with her and ask about her life, deciding it could be useful to get a better understanding of the city. \n\n[color=yellow]— I've been living in the orphanage since before I can remember... I have a sister but she left a few years ago. She now tries to earn some money for us to live on so we rarely see each other anymore. Oh, m-my name is Emily... [/color]",
        "EmilyTake": "You explain to Emily how you recently moved in and could use some help around the mansion. You can provide her with food and shelter if she won't mind following your orders. Not quite believing your words, she looks at you with wide open eyes. After few moments she responds.\n\n[color=yellow]— You would allow me? Thank you $sir... $master! I'll do my best![/color]\n\nSealing an agreement, you give Emily directions to your mansion and she leaves. ",
        "EmilyMansion": "After returning back you spot Emily seemingly struck in awe over your possession. Deciding her looks are not quite suitable for your establishment, you instruct her to freshen up and find something suitable in the wardrobe. \n\n[color=yellow]— Ah! Yes, $master, I'll do that right now![/color]\n\nEventually, Emily finds new clothes and is ready to take a shower.",
		"EmilyShowerSex": "You pass Emily a glass of water mixed with an aphrodisiac, letting her know that it would be better for her to stay hydrated before leaving. \n\n[color=yellow]— Oh, thank you $master, you are too kind![/color]\n\nAs she gulps it down, you tell her that there's no rush and to enjoy herself while she can. Seemingly unaware of your plans, Emily disappears into the bathroom. \n\nA quarter of an hour later, being sure that the aphrodisiac should've taken effect, you take a small peek. With a grin, you discover Emily sitting naked on the board, red in the face, squeezing her thighs while her fingers explore her privates. Quickly undressing yourself, you slip into the bathroom unnoticed, and approach Emily playing innocent. \n\n[color=yellow]— $master! I'm not…[/color]\n\nThe orphan girl seems to be completely shocked by your unannounced presence, her face getting even redder. Judging by the fact she is not screaming or trying to escape, you sense that she can't make up her mind on how to react, and quickly take things into your own hands. With a gentle, yet accusing voice, you tell her that you appreciate her arousal, but she can't just do what she pleases in her $master's home. Catching Emily in your trap, you make her believe that her behavior is entirely her own will and her lust is based off her desires.\n\nSeeing Emily accepting your manipulative words, you wrap your arm about her in an embrace, meeting no resistance. Despite being overwhelmed by the new situation, the aphrodisiac pumps through her veins and the orphan girl begins to awkwardly respond to your actions. As you greedily suck on her mouth, your hand hastily covers her soaking crotch, joining her own hand. With a small push, Emily shyly spreads her legs apart, giving you easier access. Stimulating her pussy, you slide a finger into her to discover she's clearly still a virgin, although that possibility had  already crossed your mind. \n\nAs she gets wetter and her moans get louder, you lay her on the bench and without further delay push your erect cock inside. The brief look of pain on her face is quickly washed away by pleasure as you begin to move within her. With every push the look on her face becomes more and more blissful, as she leans forward  trying to hug you. A few moments later she orgasms, and feeling her convulsions lead you to your own climax, filling her with hot seed. As you pull out, a stream of semen mixed with blood slowly seeps from her hard-breathing body. \n\nAfter helping her clean up, you leave the bathroom and get dressed once more.A few minutes later, she emerges from the bathroom red faced. She averts her eyes as you look at her, but you don't spot any negative feelings towards you. You leave her to get accustomed with her new role. ",
		"EmilyShowerRape": "After a few minutes, you noticed that Emily is finished with her shower and is preparing to get dressed. You rush into the dressing room and roughly push her against the wall. Shocked by your entrance, Emily tries to protest, but your hand closes over her mouth. While your other hand lecherously savours her body, you let her know that even if she yells, nobody is going to come to her rescue, and her resistance will only make things worse. Tears begin to swell up in her eyes, but her attitude quickly reveals she understands her position.\n\nWith her acceptance, you decide to make the most of this little affair and grab her small boobs, squeezing them forcefully. Pulling on her nipples with clear intent to cause some pain, you delightedly listen to her small cries and observe her pained expression. Holding her squirming body, you push into her pussy, quickly meeting the resistance of her hymen. Pausing before you break through, you roughly rub her. Despite her pleading she begins to gets mildly wet at your administrations, which makes you grin. \n\nYou bend her over and push her against the wall. Emily sobs, seemingly preparing for what she knows comes next. \n\n[color=yellow]— Please stop, I don’t want this![/color]\n\nGrabbing her ass, you force your hard cock inside her virgin pussy in one thrust making her cry out in pain, as it tears through the slight resistance of her hymen. You pause, giving her barely enough time to recover, before resuming without any further concern for her well-being. Since she's not going to enjoy it anyway, you decide it's only humane to focus on your objective. Accompanied by her sobs and cries, you mercilessly fuck her tight pussy until you finally climax deep inside of her torn privates. \n\nLeaving her sobbing on the floor, your come mixed with blood oozing from her abused pussy, you advise her to take another shower. Satisfied, you make your way out of bathroom.",
		"EmilyShowerWait": "After an hour a refreshed Emily finds you. It seems she managed to find something right for her size and with some side help even managed to fix her appearance. You give her a contented look and consider her further assignment.\n\n[color=yellow]— Thank you very much for this and everything... I'll do my best![/color]\n\nYou can't help but appreciate her sincere attitude and imagine that you might rely on her in some cases. ",
		"EscapeHeadslave": "During the night, you are awakened by the sound of yelling and a light scuffle.  Your Headslave calls out, \"Master!  The new slave Emily is trying to escape!\"\n\nYou see a diminutive figure just rounding the corner and disappearing from sight...",
		"EscapeNoHeadslave": "During the night, you are awakened by a nagging premonition.  You attempt to reassure yourself by taking a short stroll around the manor grounds.\n\nAs you approach the slave quarters, you find the door ajar.  Checking within, you discover both Emily and her belongings are absent.",
		"EscapeBrandSuccess": "You still your mind and softly murmur a mystical chant.  A dim reddish light rises from the \'Master's Sigil\' tattoo-ed on the back of your hand.\n\nThere is a glimmer of fear in the eyes of several nearby slaves as the light flies from your hand - hunting after Emily's tracks.\n\nA moment later pained screams are followed by a loud 'thump' in the direction of the Gardens.",
		"EscapeGardenCapture": "You spot a crumple of rags and various knick knacks at the base of the garden wall.  Judging from the occasional twitches and wimpering coming from the pile, Emily must be somewhere underneath.\n\nThere are a few nervous snickers from curious slaves gathering nearby.  You feel a headache coming on as you know the slaves will watch how discipline is enforced after this incident.",
		"EscapeHeadChase": "Before you can even take a step, your Headslave takes off sprinting after Emily.  Shouts of \"There's nowhere to run!\" and \"Leave me alone!\" fill the air, easily waking up the entire household.\n\nAs you round the corner, you see the curious faces of the other slaves wondering \"What's going on?\"  A cloak lies partially torn and discarded on the ground.\n\nAn odd trail of broken bread and accompaniments from this evening's servants' meal guides you towards the noisy duo.",
		"EscapeHeadCapture": "With a gaggle of sleepy slaves in tow, you cautiously approach the rear Gardens.  By now the commotion has died down and the atmosphere is oddly quiet.\n\nIt becomes clear why as you see your Headslave sitting on Emily, who appears quite distraught facedown in the dirt.\n\n\"Hmph!  Trying to embarrass me by running away while I'm in charge?  You got off easy.\"\n\nThe other slaves turn visibly more pale.  You don't think the other slaves will try misbehaving anytime soon.",
		"EscapeBrandEscape": "You still your mind and softly murmur a mystical chant.  A dim reddish light rises from the \'Master's Sigil\' tattoo-ed on the back of your hand.\n\nUnfortunately, the light fades away harmlessly as you are unable to sense Emily nearby.\n\nAfter a search of the manor grounds, all you find are some tracks into the rear Gardens and a some scattered belongings.",
		"EscapeSearchManorClue": "You see no immediate signs of Emily, so you decide to start your search within the Manor.\n\nWhile questioning the other slaves, you discover that Emily has been speaking about finding someone by the name of 'Tisha'.\n\nA search of Emily's sleeping area reveals a few additional clues.  While Emily doesn't seem to know where 'Tisha' is currently, she has marked the city of 'Gorn' as a possible location.  There are also a few references to the Slave Guild.  Perhaps there is a potential contact there?",
		"EmilyReturns_NoHelp": "In the morning you are surprised by a visit from an old acquaintance - Emily, who seems happy to see you. She briefly explains herself:\n\n[color=yellow]— I talked to my sister and she finally agreed to let me work for you. I guess she thought that if you were going to do something bad with me, you'd done it already, so... Tisha probably thinks you are not a bad person after all.  If I can, can I still stay at your place, $master?[/color]\n\nYou welcome Emily back and she excuses herself, returning to her previous duties.",
		"EmilyReturns_Helped": "In the morning you are surprised by a visit from an old acquaintance - Emily, who seems happy to see you. She briefly explains herself:\n\n[color=yellow]— I talked to my sister and she finally agreed to let me work for you. I guess she thought that if you were going to do something bad with me, you'd done it already, so... I think she was really surprised that you still helped us, even with her being angry and taking me away…  If I can, can I still stay at your place, $master?[/color]\n\nYou welcome Emily back and she excuses herself, returning to her previous duties."
	},
    "tishaQuest": {
        "MeetTisha": "As you are about to go on about your business, an unexpected guest arrives at your door, calling herself Tisha. Without any sort of proper greeting she bursts out at you. \n\n[color=yellow]— I demand you return my sister! [/color]\n\nA girl in her twenties, of lower status, glares at you with a confident and intimidating look. After a brief explanation, you realize she means Emily, the girl you took off the streets couple of days ago. Despite her clear enmity, she looks fairly attractive, with long auburn hair and gray eyes resembling her sister's. Judging by her looks, she probably works in one of the shops or another service job. She is clearly not rich, but not as badly off as those from the orphanage. As Emily is brought to you, Tisha's face shows a sign of relief.\n\n[color=yellow]— What did you think when you came here?! You don't know what these people are capable of![/color]\n\n",
        "MeetTisha_EmilyLoyal": "[color=aqua]— No, Tisha, you got it wrong, $name is a good person and $he's kind to me![/color]\n\n[color=yellow]— You are being tricked by $him! These mages are perverts or rapists, I'm not leaving you in their hands. We are going back, now! [/color]\n\nRegardless of her sister's agitations, Emily doesn't flinch.\n\n[color=aqua]— No. I'm not going back to the orphanage! I can stay here, if I want to. You don't even show up once a week and all I am left with is to beg in the streets when we don't have enough to eat. I’m staying here with $name. [/color]\n\nTisha reacts with surprise, but there's some determination left in her.[color=yellow]— Look, I know you have it tough, but so do I. You are my sister and I’ve been working additional jobs to get us enough money to live on. Some that requires me to sleep at work. [/color]\n\nThe sudden change of her sister's tone seems to puzzle Emily quite a bit. Unsure of what to say, she looks at you.",
		"MeetTisha_ChoseEmilyLeave": "You tell Emily it would be best if she respects her sister's demands. Both sisters look surprised at your words, but in the end Emily grabs her personal belongings and prepares to leave with Tisha. ",
        "MeetTisha_ChoseEmilyStay": "You back Emily's decision and tell Tisha she has no other choice than to accept it.\n\n[color=yellow]— Alright, I see then... If you are this determined, I won't bother you again. Just make sure you are not betrayed by this person. - Tisha swiftly shoot daggers at you — If something happens, I will make you pay. [/color]\n\nAs she leaves, Emily looks uncertain, but you reassure her it was the correct decision. ",
        "MeetTisha_EmilyLeave": "Without further delay you help Emily, who gives you a last doubting look before leaving with her sister. You return to your business.",
        "MeetTisha_EmilyLeaveHelp": "Before they leave, you give Emily some freshly prepared food and money which will provide them some help with their lives, without her sister’s knowledge. With that you get back to your business.",        
		"MeetTisha_EmilyBranded": "[color=aqua]— No, Tisha, you’ve got it wrong, it's not bad here. [/color]\n\n[color=yellow]— I'm not going listen to it. We are leaving. Now! [/color]\n\nYou figure out it’s time to make your move. You order Emily to come closer, and when she does so you reveal your branding on her neck.\n\n[color=yellow]— You... Bastard! I'll let people in town know what you did! I have many friends and you'll pay for this if you won't release her![/color]\n\nEven though obviously enraged, Tisha’s threats do not sound too convincing. After she finishes her rant, you feel like making a decision. ",
        "MeetTisha_BrandedLeave": "Your expression becomes a bit colder, but you call forth the energies of your 'Master's Sigil' and free Emily from her Brand.  Emily gives you a final doubting look before leaving with her sister.  You return to your business.",
		"MeetTisha_BrandedKeep": "You look down dismissively at Tisha as you inform her that you hold all rights over Emily now.  Tisha's face alternates between fury and hopelessness, but having no choice, she curses you and leaves.  Emily appears shaken, but manages to hold herself together.\n\nWith Tisha already forgotten, you return to your business.",
		"MeetTisha_BrandedSwap": "Due to branding, Emily can be considered your property. You offer Tisha the only obvious solution for her: serve you instead of Emily. Giving her a few minutes to think, you order Emily away. Finally, Tisha sees no other choice but to make a deal with you. Before that, however, you decide it would be best for her to submit to you right here, so you order her to give you a blowjob. \n\n[color=yellow]— You must have planned this from the very beginning, you bastard...[/color]\n\nSaying this she crouches and roughly pulls down your pants, revealing your manhood. In response you order her not to rush. Tisha understands her position and it seems this isn't new for her; to make a bargain by providing someone with pleasure. She got what she wanted and now it was her turn to pay back. Even though she clearly despises you, her face is mostly resigned, making you wonder how many times she’s had to solve her problems this way. \n\nWith a few confident strokes your penis stands ready and you order Tisha to go for it. In spite of having no interest, she has some skills and a pretty face. Her tongue elegantly moves up and down on your shaft, while she uses her hands to stimulate you to a quicker orgasm. Despite her hope to end this soon, you take a good ten minutes to enjoy her mouth to its full. \n\nAfter ejaculating over Tisha's face and listening to her grunts, you decide this does not exactly satisfy you yet and order her to take off her clothes. After going this far, she realizes there's no choice but to go with your demands. Under your stare the older sister reveals her voluptuous body, while still covering her privates and heavily blushing, indicating a plentitude of shame she has left. \n\nAfter savoring the look, you order Tisha to bend over the table, which she reluctantly does. Her striptease was enough to make your cock hard again. You spot her being somewhat wet as you hastily push into her pussy. Surprised by the sudden entrance the girl yelps under your weight. Her tight cunt feels just right for you, and as you proceed to move she also gets wetter. Realizing that this won't be over quickly, Tisha attempts to enjoy this intercourse by closing her eyes and quietly moaning in response to your thrusts. You decide it might be a good idea to build a relationship with your new toy sooner, rather than later. You help the girl to achieve orgasm together with you, as you pull out and cover her ass and back with your semen. \n\nAs Tisha lies breathless, you decide it's the best time to secure your new possession and perform the branding ritual over her, to which she patiently submits.\n\n[color=green]You've earned 15 mana.\n\nTisha now belongs to you. [/color]",
		"MeetTisha_BrandedSwapHonored": "Fully satisfied with your new toy, you let Emily return to the orphanage after lifting the brand. \n\n[color=green]Tisha now belongs to you.[/color]",
		"MeetTisha_BrandedKeepBoth": "You realize, as both sisters are in your possession, there's ultimately no reason (other than reputation), to respect your word and lose any of them. As you declare it, they stare at you in disbelief.\n\n[color=yellow]— No way... You tricked me!? I knew all you rich bastards were like this! [/color]\n\nIt is probably a good idea to keep a close eye on them over the next few weeks.",		
		"MeetTisha_EmilyDisloyal": "[color=aqua]— No, Tisha, you’ve got it wrong, it's not that bad here. [/color]\n\n[color=yellow]— I'm not going listen to it. We are leaving. Now! [/color]\n\nWith a little hesitation Emily obeys her sister's order and meekly leaves the room.",
		"MeetTisha_Compensation": "You let Tisha know, that taking care of Emily wasn't free and you demand compensation for her time spent with you. She looks disgusted, but obviously prepared to offer such a concession. As Emily leaves the room, she approaches you closely. \n\n[color=yellow]— You must have planned this from the very beginning. It this what you want? [/color]\n\nSaying this she crouches and roughly pulls down your pants, revealing your manhood. In response you order her not to rush. Tisha understands her position and it seems this isn't new for her; to make a bargain by providing someone with pleasure. She got what she wanted and now it was her turn to pay back. Even though she clearly despises you, her face is mostly resigned, making you wonder how many times she’s had to solve her problems this way. \n\nWith a few confident strokes your penis stands ready and you order Tisha to go for it. In spite of having no interest, she has some skills and a pretty face. Her tongue elegantly moves up and down your shaft, while she uses her hands to stimulate you to a quicker orgasm. Despite her hope to end this soon, you take a good ten minutes to enjoy her mouth to its full. \n\nShe swears, as you finally come over her face. You give her some spare clothes and time to clean up before leaving, after which both sisters leave without looking back.\n\n[color=green]You've earned 15 mana. [/color]",        
		"TishaDisappears": "During your stroll you spot Emily, who looks very worried. You decide to ask her about what's going on. \n\n[color=yellow]— Oh, $master... I'm sorry, but I think Tisha is gone. I was visiting her yesterday, but she wasn't at her workplace. Her boss said she's been missing for two days and nobody really can tell where she is. If it doesn’t bother you, please help me find her, I hope nothing bad happened to her. [/color]\n\nKnowing how Tisha might draw some attention with her attractive looks, it's not unreasonable to think she might've gotten into some trouble. However, she did oppose you previously... ",
        "TishaDisappears_Help": "[color=yellow]— Thank you, $master, I knew you would help me out![/color]\n\nEmily looks greatly relieved by your words and gives you information on where Tisha lives and works. Apparently she was employed by the Order the last few days before her disappearance.  ",
        "TishaDisappears_Deny": "You tell Emily that you are a busy person and she'd better ask for city guards to help with that. Although chances of them helping out someone like her are very slim. Emily retreats with a sore look and leaves you to your business. ",
        "TishaDisappears_SpecialService": "You tell Emily that this kind of stuff might be very dangerous, and putting yourself into trouble for someone you barely know is not very beneficial to you. As she is about to despair, you pretend to consider helping her and finally tell her that you might be able to help, if you get something from her in return. Emily gives you a troubled look, but after a long pause her worrying gets the better of her. \n\n[color=yellow]— Alright, I will trust you. I'll do what you ask if it will help Tisha. [/color]\n\n[color=aqua]Sex options for Emily unlocked[/color]",        
		"MageOrder_VisitArchives": "You make your way through Order's halls until you end up in the Archives. Huge shelves and a high ceiling, with multiple stairs all around, make you feel small and insignificant. Cautiously you go about your activities. This place is used to store massive amounts of paperwork related to the city's everyday life. n\n\nA tall, disinterested man briefly responds to your questions trying to get back to his work. He doesn’t bother to hide his irritation with you, and only shares what little he knows when it’s clear you won’t leave him in peace.\n\n[color=yellow]— Ah, that girl? Haven't seen her since yesterday morning. She was assigned to register newcomers. No idea what she's thinking about since she was only hired recently. Yeah, she also got a place in the dorms, you could try to check that out, I suppose. She’s missed two shifts now, so if you do see her tell her she’s fired. Now would you please go pester someone else?[/color]",
        "MageOrder_Dorms": "The Order's dorms are tidy and bright, albeit fairly crowded. To your mild surprise, there are quite a few non-humans, who apparently are employed for the less reputable jobs. After getting to Tisha's room, you find an elven girl in the hallway who appears to be her neighbour. After trying to get any useful information out of her, you realize that she evidently knows something. However, she also seems quite nervous about actually explaining anything.",
		"MageOrder_DormsEmily": "The Order's dorms are tidy and bright, albeit fairly crowded. To your mild surprise, there are quite a few non-humans, who apparently are employed for the less reputable jobs. After getting to Tisha's room, you find an elven girl in the hallway who appears to be her neighbour. After trying to get any useful information out of her, you realize that she evidently knows something. However, she also seems quite nervous about actually explaining anything.  Emily makes a step forward and addresses the girl:\n\n[color=yellow]— I'm sorry, but I really want to find my sister. She's the only family I have and if you can help us in any way... Please, I'd do anything. [/color]\n\nMoved by Emily's words, the girl agrees.  \n\n[color=yellow]— I-I'm sorry, $sir. There was one person who asked me about her a couple of days before her disappearance. I... I didn't think anything could really happen to her, I told him about her daily routine and when she comes back, and I thought he might be some sort of admirer of hers, or even flirting with me... But then she didn't came back and I thought she might be hanging out with him... I was afraid that I would be held responsible for her disappearance. Please, I meant her no harm! [/color]\n\nIn the end, you get a general descrition of the stranger's looks. While the decription is fairly general, you note down the stranger's slightly rough look, accent, and outfit details.  You decide it would be best to check the local town's watch for possible suspects. Near-miraculously, the description matches a group of smugglers known to be working in the area recently.  You might be able to find a connection to the smuggler group in Wimborn's back streets and alleys.",
        "MageOrder_DormsDomination": "Deciding to take a shorter route, you cast Domination spell on the uncooperative elf. She is quickly taken over by it and quickly cracks under your questioning.\n\n[color=yellow]— I-I'm sorry, $sir. There was one person who asked me about her a couple of days before her disappearance. I... I didn't think anything could really happen to her, I told him about her daily routine and when she comes back, and I thought he might be some sort of admirer of hers, or even flirting with me... But then she didn't came back and I thought she might be hanging out with him... I was afraid that I would be held responsible for her disappearance. Please, I meant her no harm! [/color]\n\nIn the end, you get a general descrition of the stranger's looks. While the decription is fairly general, you note down the stranger's slightly rough look, accent, and outfit details.  You decide it would be best to check the local town's watch for possible suspects. Near-miraculously, the description matches a group of smugglers known to be working in the area recently.  You might be able to find a connection to the smuggler group in Wimborn's back streets and alleys.",
		"MageOrder_DormsThreaten": "You decide that the quickest way to achieve your goal is to get straight and fast to the point. You show your Order's badge to the girl and let her know that if she won't start talking, you'll make sure she won't find another job in the whole city.\n\n[color=yellow]— I-I'm sorry, $sir. There was one person who asked me about her a couple of days before her disappearance. I... I didn't think anything could really happen to her, I told him about her daily routine and when she comes back, and I thought he might be some sort of admirer of hers, or even flirting with me... But then she didn't came back and I thought she might be hanging out with him... I was afraid that I would be held responsible for her disappearance. Please, I meant her no harm! [/color]\n\nIn the end, you get a general descrition of the stranger's looks. While the decription is fairly general, you note down the stranger's slightly rough look, accent, and outfit details.  You decide it would be best to check the local town's watch for possible suspects. Near-miraculously, the description matches a group of smugglers known to be working in the area recently.  You might be able to find a connection to the smuggler group in Wimborn's back streets and alleys.",
		"MageOrder_DormsBribe": "You calm the girl down, and with the help of a couple coins make her reveal what she knows.\n\n[color=yellow]— I-I'm sorry, $sir. There was one person who asked me about her a couple of days before her disappearance. I... I didn't think anything could really happen to her, I told him about her daily routine and when she comes back, and I thought he might be some sort of admirer of hers, or even flirting with me... But then she didn't came back and I thought she might be hanging out with him... I was afraid that I would be held responsible for her disappearance. Please, I meant her no harm! [/color]\n\nIn the end, you get a general descrition of the stranger's looks. While the decription is fairly general, you note down the stranger's slightly rough look, accent, and outfit details.  You decide it would be best to check the local town's watch for possible suspects. Near-miraculously, the description matches a group of smugglers known to be working in the area recently.  You might be able to find a connection to the smuggler group in Wimborn's back streets and alleys.",                
		"TishaBackstreets": "After searching through the strangers and homeless, you come across someone closely resembling the person you are looking for. Unfortunately, he has friends. The group of shady characters reacts hostilely to your approach.\n\n[color=yellow]— Huh? I don't know what you are talking about. Don’t know no such girl and haven't been there. Now piss off or I’ll stick this shiv in your ear! [/color]",
        "TishaBackstreets_FightWin": "After you defeat the other goons you capture the beaten smuggler and press him against the wall for interrogation. His reluctance to answer is soon cured by your threat to turn him over to the city's watch. \n\n[color=yellow]— Damn you... Fine, I was hired to kidnap a few local pretties. She fit the bill and was an easy target since she was running around town all the time. I don't really know who the guy was, but he had some guards with him, so probably a merchant. Paid me a few extra silver to not ask questions. Said something to one of his guys about having space for a couple of slaves on his way to Gorn, but nothing decent at the guild. That's all I know. You happy now? [/color]",        
		"GornGuild_FirstVisit": "You request to see the freshly brought in attractive human slaves, and are taken to a more exclusive, secluded part of the guild. The stone prison building holds almost a dozen spacious and clean jail cells, allowing you to get a good clear view at their inhabitants. Despite some fairly exotic and beautiful things here capturing your eye, you decide to focus on and soon find Emily's sister. She resides in a dark, medium sized cell, and judging from the spark in her eye, hasn’t lost her spirit yet. It’s easy to admire her composure as she’s probably contemplating how it would be possible for her to break free later on. \n\nAt first, she doesn’t recognize you, but soon realization strikes her and she looks at you with shock and surprise. Whatever she might think of seeing you here, the gag in her mouth prevents her from sharing. You still have to buy her way out, so you decide not to show that you know, or are even interested in her since that would just drive up the price. The guide still suspects something, though. \n\n[color=yellow]— This one is still rough around the edges, so I'd only recommend her to experienced owners, but you probably wouldn't have too many troubles with her. Still she's quite attractive and uncommon for these lands, so naturally price will be hefty. 800 gold at minimum. [/color]\n\nAfter bargaining for a while you managed to get the price lowered to 500 gold, but you still have to pay.",
        "GornGuild_Revisit": "You make your way to Tisha's cell and the guild member names the 500 gold price again.",        
		"GornGuild_Pay": "You pay 500 gold to the goblin and Tisha comes out of the cell, still bound. \n\n[color=yellow]— Do you want us to brand her for you? Naturally, that comes free as with any other slave.\n\nHearing it, Tisha's eyes widens and you realize that nothing really holds you back from taking her for yourself, since you technically paid for her. [color=#ff4949](branding will end Tisha's questline)[/color]",		
        "GornGuild_Brand": "After branding is performed onto Tisha, you take her back to the mansion. Despite your actions, Emily acts rather happy about Tisha being fine and staying with her, but her sister treats you rather coldly. Perhaps with time she'll warm up. ",
        "GornGuild_NoBrand": "You refuse to brand Tisha as you leave the guild, and instead let her go free. \n\n[color=yellow]— I... well, thank you. And sorry for how I behaved before. [/color]\n\nYou decide to interrupt her and ask if she knows anything about who brought her here, as they might be dangerous. Naturally, the slavers' guild wouldn't disclose such information willingly. \n\n[color=yellow]— No, after I was kidnapped, I was blindfolded the whole time. Can't say much, but I don't think they were humans.",
        "GornGuild_After": "With no pressing matters left here, you prepare to return back to Wimborn.  Tisha hesitates momentarily before speaking up.n\n[color=yellow]— So, about that money you paid for me... Thank you.  I... I judged you wrongly when we first met.  I'll pay back, but I don't really earn a lot and... and.. I don't know if I can see Emily right now.  Is it alright if we part ways for now?[/color]\n\nTaking into account Tisha's recent troubles, you nod in agreement before handing her a 'Wimborn' teleportation token.  Tisha shows a relieved and faintly firmer expression as she clutches onto the token.  Sensing the small spark back in her eyes, you part ways confident that you'll be seeing her again.",        
		"TishaRepaysDebt": "As you wrap up your morning breakfast, a guest arrives knocking.  It hasn't been long since Gorn, but Tisha is back at your door.  Unlike your first meeting, Tisha appears a bit less energetic.  You imagine things haven't been much easier after Gorn.\n\n[color=yellow]— G'morning.  I've... I've come back as promised.  I'd like to pay off my debt, although I've had a few difficulties.[/color]\n\nYou see Tisha is hefting a small coinsack, although she still looks a bit nervous.\n\n[color=yellow]— You see, I tried, but I've only been able to come up with 200 gold so far.  If you give me another week... I can maybe get the rest with some interest...[/color]\n\nYou can tell Tisha won't have a simple time paying the remaining debt.  You interrupt Tisha before she can continue."
		"RepaysDebt_AcceptPayment": "[color=yellow]— I see... Alright, give me a week. Thank you again. [/color]\n\nWith these words, Tisha leaves, her steps somewhat despondent.",
		"RepaysDebt_RefusePayment": "[color=yellow]— But you... ugh... stop being so nice already.  If you won't accept gold, then...[/color]\n\nLeaving the sentence unfinished, Tisha embraces and deeply kisses you.  Tisha steps back and starts slowly stripping off her clothes. She tries to make a show of it and clearly hasn’t had any practice, but she's certainly aware of your eyes on her and amateurishly tries to tease you. It occurs to you how suddenly things have changed with Tisha, but you realize that recent hardships and your actions likely triggered her to feel a lot stronger about you. \n\nAs her voluptuous breasts come on display, you notice how her body complements her looks in a great way. Noticing your inactivity, Tisha raises her voice.\n\n[color=yellow]— What, are you going to make me do everything by myself? How nasty of you. Come on, take off your stuff![/color]",
        "RepaysDebt_CounterofferSex": "You indicate to Tisha that she can pay off her remaining debt with sex.  Surprisingly, she shows no hesitation, possibly even a little eagerness.  With a sly look of understanding, she puts on her best seductress voice...\n\n[color=yellow]— Mmm... That's such a big debt... I'll have to make sure I give my *best* service.[/color]\n\nTeasingly moving close, Tisha embraces and deeply kisses you.  Then, with a step back and a little flourish, she starts slowly stripping off her clothes.  Gradually, articles of clothing fall to the ground with graceful flutters, revealing her slim figure and tantalizingly revealing lingerie.  She pulls you close, undoing your shirt before turning around and inviting you to undo her bra.  As her top falls off, she slowly undoes your pants as she presses her behind into your crotch. It occurs to you how suddenly things have changed with Tisha, but you realize that recent hardships and your actions have likely triggered her srong feelings towards you.\n\nYour mind has little room to wander as she turns back around, putting her voluptuous breasts on display.  You gaze admiringly at her, while Tisha, noticing your inactivity, slips her hand into your underwear.\n\n[color=yellow]— What, are you going to make me do everything by myself? Off with those pants and I'll give you something to remember![/color]",
		"RepaysDebt_SexNoCock": "Tisha steps back and starts slowly stripping off her clothes. She tries to make a show of it and clearly hasn’t had any practice, but she's certainly aware of your eyes on her and amateurishly tries to tease you. It occurs to you how suddenly things have changed with Tisha, but you realize that recent hardships and your actions likely triggered her to feel a lot stronger about you. \n\nAs her voluptuous breasts come on display, you notice how her body complements her looks in a great way. Noticing your inactivity, Tisha raises her voice.\n\n[color=yellow]— What, are you going to make me do everything by myself? How nasty of you. Come on, take off your stuff![/color]",
		"RepaysDebt_SexNoCockEndEnd": "As your quickly undress, Tisha looks excitedly at your flushed skin and erect nipples, knowing she’s the reason.  She moves seductively towards the bed, leading you on.  As she moves to push you down, you surprise her with a massive strap-on hidden under the bed.  With a 'click' and a 'snap' you're ready to go.  She climbs on top and without any delay lowers herself onto your rock strap-on, its nubs stimulating you as she rides on top. Her damp, tight pussy hungrily wraps around you, drawing involuntarily moans from both of you.  As your strap-on hits her womb, her face radiates with a pleasant smile. While still being impaled, she moves her face down to give you another long wet kiss, as her pelvis grinds against yours. \n\nAs you both move towards climax, you enjoy the sight of her tits swaying gorgeously before your eyes.  You tease her delicate nipples with your hands before suckling them in your mouth. Tisha is immersed in the moment, panting heavily and she drives herself down fully onto the your massive strap-on.  Even though she doesn't seem very experienced, Tisha is clearly trying her best and enjoying herelf greatly - moaning with each thrust and yelping as you pinch and probe with your naughty fingers. \n\nAs her actions become wilder and wilder, you begin thrusting strongly in time with her motions.  As you see her approaching orgasm, you vigorously slide a fluid-slicked finger in and our of her virgin anus.  Tisha lets out her highest cry yet, tightening on your finger and the strapon as you both reach orgasm. She collapses next to you, exhausted, but looking quite satisfied.",
		"RepaysDebt_SexCock": "Tisha steps back and starts slowly stripping off her clothes. She tries to make a show of it and clearly hasn’t had any practice, but she's certainly aware of your eyes on her and amateurishly tries to tease you. It occurs to you how suddenly things have changed with Tisha, but you realize that recent hardships and your actions likely triggered her to feel a lot stronger about you. \n\nAs her voluptuous breasts come on display, you notice how her body complements her looks in a great way. Noticing a rising bulge in your pants, Tisha look at you provocatively, exclaiming...\n\n[color=yellow]— What, are you going to make me do everything by myself? Come on, take off your stuff and let me see that bad boy![/color]",
        "RepaysDebt_SexCockEnd": "As your erect cock is revealed, Tisha's face flushes as she eyes you hungrily.  She can't help but smirk, looking pleased at herself, knowing she’s the reason for your excitement.  She moves boldly, pulling you towards the bed and pushing you down.  She climbs on top without any hesitation and lowers herself onto your rock hard member. Her damp, tight pussy hungrily wraps around you, as you both involuntarily groan in pleasure. As your cock hits her womb, her panting becomes louder and her face radiates with desire. While still mpaled, she moves her face down to give you another long lingering kiss, tongues intertwining.\n\nAs the excitement builds, Tisha starts moving up and down with greater vigor taking the entire length of your shaft as she grinds her pelvis into you.  As her tits sway gorgeously before your eyes, you decide to give them support while teasing her delicate nipples with your hands. Even though she lacks some experience, you can clearly see Tisha trying her best to entice you by jiggling her breasts and bringing them closer.  Unable to resist, you bring her plentiful breasts to your mouth, suckling and lightly nibbling each nipple.  You hands wander lower and you pinch her ass and rub your fingers against her dripping pussy.  Each pinch is matched with a cute yelp and Tisha's moaning becomes longer and more desperate.  In less than a minute, Tisha is lost in pleasure and her rising gasps and cries lose any sort of pattern. \n\nAs her actions become wilder and wilder, you can't help but move closer to orgasm. Eager for more stimulation, Tisha trembles with anticipation as your fluid-slicked finger traces circles around her virgin anus before easily slipping inside.  Feeling her tighten on your cock and finger, you thrust deeply in rhythm with her motions. Finally, as she lets out her highest cry, her convulsions bring you to orgasm, filling her with your seed. Utterly exhausted, she collapses on top of you, trying to catch her breath in the shared afterglow.",
        "RepaysDebt_OfferStay": "[color=yellow]— You mean that? I would need some time to settle things up a few things, but... Oh, whatever, I still owe you... owe you so much - that money you paid, helping my sister, saving me... Wait, didn’t you technically buy me then? Geez, now I'm talking nonsense. Fine then, I'll also get to spend more time with Emily. You are too good natured, you know. That might really bite you in the ass one day.  Guess I'll have to stick around to help out then.[/color]\n\n[color=aqua]Tisha joins your household.[/color]",
		"RepaysDebt_NoStay": "Both you and Tisha lay down naked. \n\n[color=yellow]— Thank you for taking care of Emily. I was really scared back then when she left the orphanage, but I'm really happy for her now. I always thought of her as naive and vulnerable, but after she ended up with you, I actually had less worries on my mind. Whoops, sorry, I didn't mean to bring her up all of a sudden now. It's been a rough few days. Well, maybe I'll be able to find someone as reliable as you in the future, it's hard to take care of everything on my own. Not... not that you have to worry about me.  I'll still be around!  I have to visit my sister every once in a while![/color]\n\nA little afterwards, Tisha gets ready to leave.  She spends some time with Emily and finally says goodbye to the both of you, now with a noticeable friendliness.",        
		"TishaPayment" : "While immersed in work at the mansion, you are distracted by the arrival of a courier.  Upon signing for delivery, you receive a package from Tisha.  Inside is another 200 gold and a small satchel of gems easily worth 400 additional gold.  You find a short note at the bottom written in shaky hand.\n\n[color=aqua]—I've included 200 gold and gems worth about 400 gold.  This should cover my remaining debt and interest.  Thank you again for the help you've given me and my sister.  I hope you will continue to look after my sister in the future.\n\n Warm regards,\n Tisha[/color]\n\nThe note leaves you with and odd feeling, but there is no return address or clue to where Tisha is now.  With a sigh, you pocket the gold and gems.",		
		"TishaEmilySex": "Having sufficiently developed both girls' sexuality you come up with the idea to pair the two sisters and test if they are open to new fascinating experiences. \n\nFirst you talk to Tisha and propose to her an interesting game you’d like to try: she'll have to have sex with another girl while the two of them are blindfolded. You will be the judge and whomever shows the most enthusiasm, will get a reward of their choice. Although Tisha is somewhat reluctant at first, she eventually accepts your proposal after hearing how she might get to take a whole week off from work with Emily. After getting her agreement, you approach Emily with the same proposal. She quickly agrees with a hint of excitement at trying something new. \n\nYou choose a dark room with a spacious bed and vape it with some mild aphrodisiac intoxicating incenses. After preparing both girls in separate  rooms, you lead the blindfolded Tisha to the bed and make her wait, before leading a naked Emily to her. Both girls, already free of clothes, slowly begin to explore each others bodies with their hands. Tisha, being the more assertive of the two, upon realizing her partner is a little more timid and slightly smaller, takes the leading role and pulls her sister in closer for a deep kiss. As their mouths passionately merge, Emily, noticing that the initiative is being taken away from her, tries to take it back by clumsily attacking her sister's crotch with her fingers. \n\nThe room quickly fills with pants and the heat of the two siblings attempting to unknowingly please you. After you feel both girls are consumed by their act, you give them a sign indicating Tisha to lay down. After positioning Emily between Tisha’s legs in a position to give oral, you for a moment consider joining in the action, but decide it's too risky, and if everything goes to plan you will have access to both sisters at any time. While the younger sister timidly attempts to lick Tisha's already very moist orifice, you prepare an additional toy. \n\nYou briefly take Emily away from her sister's cunt to quickly equip her with a double ended strap-on. She makes an almost soundless moan as you insert one end into her pussy. After giving her a few moments to adjust to the new sensation, you help her to press it against Tisha's already prepared pussy and give her ass an inspirational slap. The older sister, figuring out your plans, tries her best to be an active participant despite being on the receiving end and helps guide the dildo with her hands. Finally, Emily thrusts her hips forward, causing her sister to gasp in response as the dildo slides into her. \n\nWithout taking too long, the younger sister quickly learns to use the new artificial organ to fuck Tisha's pussy. On the receiving end Tisha embraces her partner with all she can, locking her legs behind her back and occasionally bringing her head up for a smooch. Upon seeing Emily on the verge of orgasm, you carefully take off her blindfold and gesture for her to keep quiet. Emily's lust filled eyes adjust to the situation and the person before her. She takes only moments to accept the fact that she's doing it with not just anyone, but her sister. \n\nAfter giving Emily some time to build up to her previous pace, you direct Tisha to sit face-to-face with Emily while still being connected by the dildo. You give Emily an order to continuously kiss her sister, while you wait for the right moment. As Tisha becomes seemingly lost in her sister's mouth and they both approach climax, you pull the blindfold from Tisha’s head revealing her partner. Tisha, while very much intoxicated by the whole situation, responds with more surprise than her sister.\n\n Tisha pulls back from her kiss with Emily, shooting you a glare. She opens her mouth to say something but is interrupted by Emily, who pulls her back in to kiss her.\n\nEmily continues to passionately kiss Tisha's lips, keeping her eyes closed as she edges on the verge of climax. Finally Tisha succumbs to her sister as Emily’s orgasming body pushes her over the top, making her cum too. Finally you call an end to the competition and both sisters drop down breathless. They hold onto each other trying to take in the position they find themselves in.",
        "TishaEmilySex2": "[color=yellow]— You are such a jerk, you know that? I should've figured something was up the very moment you brought up the blindfold. [/color]\n\nEven though Tisha is voicing her protest it does not carry any outrage, which is a good sign. In response to her sister's outburst Emily tries to protect you.\n\n[color=yellow]— But, Tisha, didn't you like it? And I’m happy doing it with you! I hoped you would feel the same way... I know, this is a bit improper, but I'm glad we have the chance to get even closer now. [/color]\n\nHearing her sister’s praise and enjoyment of their coupling Tisha seems to have no response. Giving in, she only gives you a grumpy look.\n\n[color=yellow]— Okay, you are right, it wasn't too bad. Maybe next time we should punish someone for playing tricks on us in a similar way... but more importantly, you owe us, don't you? A paid vacation! \n\nAfter letting both sisters leave together for a week, you consider what new fun things you might have in store for them the next time. "
    },
    "caliQuestTexts": {
        "CaliTalkRequest": "You decide to spend some time talking to Cali since she’s been acting strangely lately. When you approach her and ask what’s wrong she replies.\n\n[color=yellow]—Look, I’m grateful you took me in, but I’m a bit worried about my parents. The bandits that captured me were saying something about not getting as many slaves as usual this time. I think they were planning more raids.[/color]\n\nCali gives you a gloomy look and shakes her head...\n\n[color=yellow]—They were a real bunch of assholes. After the first time I tried to get away they beat the crap outta me. They were planning to sell me to some freak, who I heard enjoyed turning stubborn halfkin-girls into pets. I tried to escape, but they caught me that time too. After that they kept me heavily tied up and under close watch. Luckily I was eventually able to find a way to escape.. With the raids they mentioned, I’d really like to know if my parents are ok.[/color]",
        "CaliTalkHelp": "You decide to talk to Cali about helping her find her parents. She seems glad that you remembered your promise and asked her about it. \n\n[color=yellow]—I want to thank you again for helping me out. Ending up in a prison would be really bad. I’m still worried about my parents though,The bandits that caught me were a real bunch of assholes. After the first time I tried to get away they beat the crap outta me. They were planning to sell me to some freak, who I heard enjoyed turning stubborn halfkin-girls into pets. I tried to get away again, but they caught me that time too. After that they kept me tied and under close watch, but luckily I finally managed to escape. With the raids they mentioned, I’d really like to know if my parents are ok. [/color]\n\nYou tell her that you were glad to help and ask if there’s anything she can tell you to help you locate them. She seems a little embarrassed when she replies.\n\n[color=yellow]—Um...well, that’s kinda the problem. I’m not sure where to look. We lived way out in the forest away from everyone else and after they got me, I wasn’t really paying attention to where they were dragging me.[/color]\n\nYou express your concern about the bandits. Isolated kidnappings and attacks are a fact of life, but organized bands are a real threat. From what it sounds like, she has a legitimate reason to be concerned about the safety of her family. Thinking about it for a bit, you decide it might be worth checking the nearby villages for some sort of lead on the bandits. If they really have been raiding in the area, you might be able to locate the group that captured Cali and get a better idea where they found her at. ",
        "CaliTalkRefuse": "You tell Cali that there’s nothing to worry about and that she should just focus on her new duties. She’ll be safe as long as she’s with you and that you’re sure her parents are fine. She seems a bit put off by your apparent lack of concern and you catch her scowling as you leave...",
        "CaliTalkAccept": "You express your concern about the bandits. Isolated kidnappings and attacks are a fact of life, but organized bands are a real threat. From what it sounds like, she has a reason to be concerned about the safety of her family, besides just wanting to see them again.\n\n[color=yellow]—Could you find out if they’re all right? Yeah, I know you’re already giving me food and a place to stay, but this makes me worried.[/color]\n\nYou think about it for a moment. If you could offer some evidence that her family is unharmed she’d probably be more willing to listen to you. You make up your mind and ask if there’s anything she can tell you to help you find them.\n\n[color=yellow]—Um...well, that’s kinda the problem. I’m not sure where to look. We lived way out in the forest away from everyone else. After they captured me, I wasn’t really able to pay attention to where they were dragging me.[/color]\n\nShe seems somewhat irritated, though not at you.\n\n[color=yellow]—I could find my way back if I came by some of the places I used to scout and play before. [/color]\n\nCali seems somewhat embarrassed by her explanation, and you reassure her that you’ll see if you can find some sort of clue about where she was taken from. Perhaps you could ask around in nearby villages if they’ve been having any problems with bandits lately.\n\n[color=green]Cali's opinion of your improved.[/color]",
        "CaliVillageEnter1": "Upon entering the village, you notice a cluster of people gathered around the town well talking fearfully amongst themselves. Some of them are complaining that bandits have been stealing their livestock and attacking lone travelers, while an old man is asking if anyone has seen his granddaughter.\n\nYou approach the villagers and ask what’s going on. They start peppering you with stories of how their farms are being raided by a group of bandits that seem to have taken residence in the area. When you offer to look into it, they promise to give you a reward if you can put a stop to the attacks.\n\nYou walk over to the old man and ask about his granddaughter being missing. He seems a little nervous to be talking to a mage, but answers you.\n\n[color=yellow]—Well, $sir, my granddaughter Tia was out picking berries in the wilds yesterday and she didn’t come home like she was supposed to. When I went out to go look for her, I found her basket but there was no sign of her. Please $sir, with all the recent attacks I’m worried that she got taken by a group of bandits. If you can find her I can’t tell you how grateful I’d be. She’s just a sweet young thing and I don’t want to think of what might happen to her.[/color]\n\nYou ask him to tell you where he found her basket and he describes the location to you.\n\nAfter considering what you’ve found out from the old man and the villagers you decide to see if you can track down this group of bandits.",
        "CaliPoisonBandits": "As you consult with your leading companion - $name, $he mentions that $he saw some poisonous berries nearby and offers to try to poison the mead barrel. You accept, and warn $him to be careful. $He stealthily moves off into the woods. A few minutes later, the bandits that are drinking are distracted by a sound and start poking around the brush. You see $name quickly sneak up to where the bandits left their mugs, adding something to each. As $he disappears back into the forest you admire $his skilled woodcraft, startled when $he pops up behind you. As you watch the bandits resume their drinking,  it does not take long before they start acting oddly. One lies down and apparently goes to sleep, while the other starts throwing up into the bushes before collapsing.",
        "CaliDominateBandits": "When the sentry wanders near your position, you quietly cast the Domination spell on him. With glazed eyes he listens as you tell him to start a fight with the two bandits arguing over the girl and try to kill them.\n\nIn a monotone voice he replies 'Yes Master' and goes over to where the bandits’ argument is growing noisier. You can’t make out exactly what is said, but suddenly the bandit you dominated draws a dagger and stabs one of the other bandits in the stomach. The other curses and draws his sword, making short work of the bandit under your command.",
        "CaliBanditCampVictory": "You look around the camp in disgust. You meant to leave at least one of the bandits alive for questioning, but were too caught up in the moment to remember. Turning your attention to their captive, you have to admit they at least had good taste. The girl is very pretty and looks at you nervously. After you ungag her, the first thing she does is thank you.\n\n[color=yellow]—Are...are you here to rescue me? I was sure I was about to be raped and sold as a slave. [/color]\n\nYou explain that you were actually trying to hunt down the bandits for information, but got a bit too caught up in the matter. After you tell her this, she nods slowly and hesitantly offers to tell you what she overheard.\n\n[color=yellow]—I’m not sure how much help this is, but I heard one of the bandits talking about about a slaver camp in the crossroads. They mentioned that their boss went off to explain to the slaver why they didn’t have the wolf-girl they promised to deliver. Some of the bandits were worried that the boss would kill them if they didn’t come up with enough loot by the time he got back and hoped he would be distracted by me. That’s...that’s all I know. Please, could you take me home? I live in Shaliq village and I’m sure my grandpa would reward you for bringing me back...[/color]\n\nA thought comes to mind as you consider what you’ve heard. From what it sounds like, this was, in fact the same group that captured Cali, and it looks like you’ll need to visit that slaver camp to get any more information. You could return the girl to her grandfather and you’re sure you’d probably get a nice bonus in addition to the bounty for killing the bandits. On the other hand, the girl is very pretty and you could just say you never found her.",
        "CaliReturnGirl": "Deciding you’d rather gamble on the generosity of the girl’s grandfather, you agree to take her home. It’s getting late, so you merely drop her off in Shaliq on the way back to your mansion, promising to return in the morning for your promised reward.",
        "CaliKidnapGirl": "After considering the matter, you decide whatever few coins the villagers could scrape up are nothing in comparison to the value in taking this girl as a slave. Without further hesitation you swiftly knock the girl unconscious and return to the mansion, dropping her off in your jail. ",
        "CaliSeduceGirl": "Casting the Entrancement spell, you begin talking to Tia, explaining how she’s better off as your servant, how her grandfather clearly can’t protect her and how very pretty you think she is. It takes only a short while for her to agree and she follows you the the mansion, convinced by the effects of your spell.",
        "CaliVillageEnter2": "When you return to Shaliq, several of the villagers gather round and ask if you’ve had any luck with the bandits. You regale them with the story of how you and your companion cleared out a group of the scum hiding in the wilds. When Tia’s grandfather asks if you had any luck finding his granddaughter, you apologize and tell him that there was no sign of her. He walks off sadly while the rest of the village buys you a round of drinks at the bar, asking you to retell the story over and over. Finally, one of the men approaches you with a small bag of gold.\n\n[color=yellow]—Here, It’s not much, but we all pitched in. Thank you for getting rid of those bandits for us.[/color]\n\nWhen you open the bag and see the measly 50 gold, you think to yourself that taking the girl was the right move. After all, it’s not like these country bumpkins would have had any real money. Still, you thank the men and head back to your mansion. You should probably let Cali know what you’ve found out so far.",
        "CaliVillageEnter3": "As you enter the village of Shaliq, there’s an immediate cheer when you’re spotted. Apparently they’ve already heard what happened from the girl you rescued. Not much of a surprise there since you just dropped her off at the inn before leaving. Suddenly, you’re almost knocked off your feet by a very enthusiastic hug - more a tackle, to be honest. You realize it’s the girl you rescued and see her grandfather beaming at you.\n\n[color=yellow]—I can’t thank you enough for what you’ve done. Tia told us everything. I can’t believe you and your companion managed to take out more than twice your own numbers in bandits, let alone save my granddaughter in the process. We took up a collection last night to reward you. Here, please take it.[/color]\n\nOpening the bag, you’re stunned to see what must be over 300 gold coins. This has to represent the savings of nearly everyone in the village.",
        "CaliVillageAcceptReward": "You close the bag and shake your head. It’s really too much, but you don’t want to scoff at the generous offering. You thank the men, shaking several hands and get another hug from Tia before you return to your mansion. Now you just need to let Cali know what you’ve learned so far.",
        "CaliVillageRefuseReward": "You close the bag and hand it back with a bit of regret. You tell the villagers it’s really too much and that honestly, you weren’t doing it for the reward. They should save the money for when the village has a poor harvest. The looks you get back are equal parts stunned and admiring. Finally one of the burly men from the crowd speaks up.\n\n[color=yellow]—That’s downright generous of you $sir. I’m sure we’ll find a use for the money, but I think I’m speaking for everyone when I say we can’t just let you go without some kind of reward. We can help you out with some materials you could use for your estate.[/color]\n\nSeeing the rest of the crowd in agreement, you shake your head ruefully and agree to let them do some sprucing up. While that’s being done, you think it’s time you let Cali know what you’ve learned so far.\n\n[color=green]Gained additional upgrade points.[/color]",
        "CaliTalk2": "When you greet Cali, she immediately asks if you’ve learned anything new and you explain that while you haven’t found out much about her parents, you’ve learned of a slaving operation near the crossroad. Further, that the leader of the group that captured her seems to have went there. Since you killed the other bandits, you tell her that your only hope of finding more information on where she was taken from is to infiltrate the camp and try to get close to the bandits’ boss.\n\n[color=yellow]—Ya know, there might be a way I could help you get in. If we pretend like you captured me and were bringing me to the slaver, you might be able to get into the camp without attracting suspicion.[/color]\n\nYou pause and think about it for a moment.",
        "CaliTalk2Accept": "You warn her it might be dangerous, but if she’s willing, it might make things easier. She has a serious expression on her face as she replies.[color=yellow]\n\n—I know it’s a bit risky, but I want to help out since this involves me in the first place. I can act pretty persuasively too. [/color]",
        "CaliTalk2Refuse": "You shake your head and tell her that it’s too risky. If the bandit boss sees her there it might make him suspicious. She seems a bit put out by you declining her offer, but says she understands and that she’ll wait here until you’ve gotten the information.",
        "CaliBarEntrance": "You decide to visit a local bar in attempt to find some clues about Cali's origins. After a few minutes of casual talk the barkeeper points you in a few directions. Following them leads you to one ruthless looking man who seems to deal in slave trafficking, however Cali does not recognize him. You decide to talk to him directly. After a brief introduction he tells you to call him Jason.\n\n[color=yellow]— Halfkin slavers? Well, I could name a place or two, but what's in it for me? You seem to be in a rush though and I think I know exactly who you would be looking for. [/color]\n\nTelling him to get to the point, he proposes a deal.\n\n[color=yellow]— 500 gold. Semi-legal slavers have their own fears and who knows;  you might be one of those Militia dogs sniffing out an easy promotion. Or... — He gives Cali a dirty look, making her feel uncomfortable. — I wouldn't mind having some fun with your girl, she's pretty cute and I really like that rebellious look. Obviously she wouldn't be worth this much, but that would be enough proof of your good will, right? I'll tell you what you want for 100 gold then. [/color]",
        "CaliBarRepeat": "You enter the same bar and find your previous acquaintance slowly drinking at one of the tables. \n\n[color=yellow]— You again? Did you get the money? Remember, no money no info. Or did you persuade your girl for a discount? [/color]\n\nCali looks at Jason with uneasiness.",
        "CaliBarLastpay": "Jason meets you with a bored look. \n\n[color=yellow]— I still need those hundred gold. Have you got them?[/color]",
        "CaliBarPay500": "[color=yellow]— Alright, the guys you are interested in can be found in a nearby village. Shaliq it was I believe? Just ask locals, they have been pretty active recently. [/color] ",
        "CaliBarPay100": "[color=yellow]— Alright, the guys you are interested in can be found in a nearby village. Shaliq it was I believe? Just ask locals, they have been pretty active recently. [/color]",
        "CaliBarLeave": "You leave the Bar and head back onto the streets.",
        "CaliBarTalk": "You take Cali into an isolated spot to discuss the situation. ",
        "CaliBarForce": "You explain to Cali, that 400 gold is a huge sum of money you don't have on hand and it's essentially her duty to do anything she can to help find her parents. Having sex with this man is a small price for their well-being. \n\nAfter a long moment of silence she sighs and agrees with a pained look on her face. \n\n[color=yellow]— You are right... This is like a horrible dream. Fine, I'll do it.[/color]\n\nWith her confirmation you return to the mercenary. ",
        "CaliBarDeny": "As you drop the issue, Cali sighs with relief. There's likely some other ways to deal with Jason without involving her. ",
        "CaliBarPersuadeSuccess": "You explain to Cali how you would like her to take this as an opportunity to learn new things and overcome her shyness. There should be no danger and they also get a nice bonus helping her own cause.\n\nShe's taken aback by your suggestion, but you notice some curiosity and budding lust in her eyes. \n\n[color=yellow]— Y-you think so? I... wouldn't want to do this, but if you want me... Alright. I will do it with him.[/color]\n\nYou smile back at her, satisfied with her decisiveness and prepare to return to the mercenary.",
        "CaliBarPersuadeFail": "[color=yellow]— NO!! I won't stay alone with that man even for 1 minute! Why are you even suggesting this?? I can't believe you would want me to have sex with him![/color]",
        "CaliBarFuckUnwilling": "After passing Cali a contraception, you send them off to one of the Bar's private rooms. After what feels like a couple of hours they finally show up again. Jason wears a smug, satisfied grin, while Cali's face appears red from recent tears. You spot a couple of bruises on her body, indicating she probably tried to struggle.\n\n[color=yellow]— She's nice and tight, but you should really discipline her better. Alright, 100 gold and I tell you everything you want. [/color]",
        "CaliBarFuckWilling": "After passing Cali a contraception, you send them off to one of the Bar's private rooms. After what feels like a couple of hours they finally show up again. Jason has a greatly satisfied look on his face. Cali looks fairly tired, disheveled and sways slightly while walking, but otherwise there's no uneasiness on her face. It seems they found a common language.\n\n[color=yellow]— I haven't had such fun in quite a while, you got one amazing girl for her age, Pal. Ya know, keep the gold, I'll tell you what you want.[/color]\n\nAfter getting the slaver camp location, you tell him goodbye and return back to the Mansion with Cali.",
        "CaliBarAskSebastian": "After describing your situation to Sebastian, you ask him if he could help somehow.\n\n[color=yellow]— Oh, Jason, you say? Yes, yes, I know him. Pretty reliable guy when it comes to work, but he's not in the business just for money. You probably have figured it out already though. — He gives Cali a quick glance, — Well, I assume you came to me so the young lady wouldn't need to deal with something nasty like his offer. Truth to be told, he owes me a favor since the time I let him... well, you don't really need to know about that. \n\n— Take this note, he should recognize it and at least cut a hefty sum from his service. Oh, don't worry about it, after all you helped me before, and I expect us to have a profitable partnership in the future. It's a pleasure to forge a friendship with someone of your caliber![/color]\n\nAfter taking the debt note from Sebastian, you leave and can visit Jason again. ",
        "CaliBarUseSebastian": "After seeing the note Jason sighs heavily.\n\n[color=yellow]— Oh... I guess debts really chase after you even if you forget them. Fine $name, 100 gold and I'll tell you everything. [/color]\n\nAfter hearing this Cali is relieved, not worrying about having to deal with him anymore. ",
        "CaliSlaversTaken": "As you look around the Crossroads, you notice what seems to be a collection of tents and cages, set back from the road a bit and fenced off, except for an opening guarded by a pair of rough-looking sentries. When you approach, their bored expressions vanish and they look at you with suspicion.\n\n[color=yellow]— Hold up there. This is a private encampment, unless you have business here you should be on your way.[/color]\n\nYou tug a lead and Cali stumbles out from behind you, dressed in a scruffy tunic. Before coming here, you managed to convince her the only way you’d be taken seriously was if she really did look like a prisoner. She wasn’t exactly thrilled with the idea, but agreed as long as you made her bindings loose enough that she could slip out of them quickly.\n\nUpon seeing the half-kin girl one of the sentries smirks, while the other starts looking bored again. You explain that you heard there was a slaver here that was interested in half-kin girls and wanted to see if you could make some gold.\n\n[color=yellow]— Yeah, guess you heard right. Alright, show her to the boss. — He jerks a thumb behind him. — Look for the red tent near the center of the encampment.[/color]\n\nYou notice Cali bristling at the dismissive tone and shoot her a warning look before thanking the guard and heading in. Despite its small size, the encampment is crowded with tents and cages. You can hear the sounds of whips and screams in the background, and you can see Cali’s eyes widen as she sees a pair of half-kin catgirls naked and covered in welts in one of the nearby cages.\n\nYou finally manage to locate the red tent the guard mentioned and walk inside. You are immediately greeted by the sight of a corpulent man dressed in gaudy clothes, scribbling on some papers at a table.\n\n[color=#ff4949]— What is it? I told you not to bother me again today![/color]\n\nHe doesn’t bother looking up. Clearing your throat, you try to get the man’s attention. After a minute the man looks up, seemingly surprised.\n\n[color=#ff4949]— Huh, you’re not who I thought you were. Forget it, what’s your business with me?[/color]",
        "CaliSlaversLeft": "As you look around the Crossroads, you notice what seems to be a collection of tents and cages, set back from the road a bit and fenced off, except for an opening guarded by a pair of rough-looking sentries. When you approach, their bored expressions vanish and they look at you with suspicion.\n\n[color=yellow]— Hold up there. This is a private encampment, unless you have business here you should be on your way.[/color]\n\nYou explain that you heard you might be able to purchase some exotic slaves here and wanted to see what was available. One of the sentries spits and looks away, clearly uninterested. The other one gives your clothing a measuring look and replies.\n\n[color=yellow]— Maybe, but we don’t just let anyone in here. Unless you’ve got a token you’ll need to pay the entry fee. 100 gold.[/color]",
        "CaliSlaversPay": "The guard carefully counts out the money then jerks a thumb back towards the center of the camp.\n\n[color=yellow]— You want to look for the red tent near the center. If you’re here to buy you’ll need to speak to the boss. He’s been in a foul mood lately though, so watch yourself.[/color]\n\nAs you enter the camp it’s clear this is a fairly large operation. There’s tents and cages throughout the cramped space and the sound of whips, cursing and screams fill the air. The smell isn’t exactly pleasant either and a quick glimpse at one of the cages shows one of the reasons. Inside is a young half-kin girl, huddled in a fetal position and covered in her own filth. Other cages have more of the same, the few occupants that dare meet your eyes look at you with fear.\n\nYou finally manage to locate the red tent the guard mentioned and walk inside. You are immediately greeted by the sight of a corpulent man dressed in gaudy clothes, scribbling on some papers at a table.\n\n[color=#ff4949]— What is it? I told you not to bother me again today![/color]\n\nHe doesn’t bother looking up. Clearing your throat, you try to get the man’s attention. After a minute the man looks up, seemingly surprised.\n\n[color=#ff4949]— Huh, you’re not who I thought you were. Forget it, what’s your business with me?[/color]",
        "CaliSlaversOffer": "The man notices Cali behind you and looks at her for a moment, then stands to walk around the table.\n\n[color=#ff4949]— Oh, I see you brought one of those filthy half-breeds with you. Were you looking to sell her?[/color]\n\nYou shrug and tell him she’s been nothing but trouble and that you’d heard there was someone here that might find her worthwhile. Even though you’d warned Cali you might do this, she still seems a bit worried. Your trip through the camp must have made an impression on her.\n\nThe man steps closer, ponderously making his way around her. After a minute or two he nods to himself.\n\n[color=#ff4949]— Well, she’s not much to look at. She seems like she has some spirit in her though, that might make her entertaining to break. If you want to sell her I suppose I could offer 350 gold for her.[/color]\n\nYou find the offer surprisingly good You’re sure that if you sold Cali at the slave market you’d get far less so this is actually a very good price.",
        "CaliSlaverSell": "When you agree to the offer, Cali looks shocked for a moment then starts to struggle with her bonds while shouting.\n\n[color=yellow]— You fucking bastard, I knew I couldn’t trust you![/color]\n\nYou put a quick stop to her nonsense with a quick jerk to the lead running to her hands. She apparently never noticed the knot you tied was actually a slipknot, and your yank simultaneously draws the bindings tight and knocks her off balance. The slaver just watches with interest as you quickly subdue the struggling wolf-girl. After she’s been thoroughly hog-tied you tell the slaver to keep a close eye on her and that she’s already escaped from one set of captors before. The slaver just smiles, an evil glint in his eyes as he replies.\n\n[color=#ff4949]— Oh, trust me, I know just how to deal with a girl like her. First I’ll spend some time beating her so she knows her place, then I’ll pass her around to be raped a few times. If any of my men aren’t pleased, she’ll be beaten again. Of course if it looks like she’s too badly injured, I’ll just have to heal her. After a few days she’ll be begging to please every man in the camp.[/color]\n\nAfter you heard the man mention he’d heal her, you instinctively looked to see if the man was wearing a distinctive ring. Seeing it, you nod to yourself. The man counts up your gold from a small chest behind the table and hands it to you.\n\n[color=#ff4949]— Ah, and if you’re ever in the market for an animal, stop by again. I may have something to interest you. Here, let me give you my token so that the guards know that you are welcome here.[/color]",
        "CaliSlaverNoSell": "You act as though you are considering the offer for a while before you shake your head and explain that you have a friend that had already expressed an interest and would likely pay you more. The Slaver looks at you with irritation. Before he can demand you leave and stop wasting his time you tell him that the main reason you wanted to see him was to inform him of a problem.\n\n[color=#ff4949]— What do you mean I have a problem?[/color]\n\nDespite his obvious irritation, your serious tone seems to have caught his attention. You explain that you had recently been by Shaliq village, where you overheard an interesting tidbit in the local inn. Over the next several minutes you weave together a convincing story that the residents of  Shaliq had caught several members of a bandit gang that had been raiding nearby farmsteads, and after questioning them they had claimed to be working for him.\n\n[color=#ff4949]— What!? That’s ridiculous. I never ordered any attacks on farms, and I certainly have no interest in dealing with human girls.[/color]\n\nAfter you explain that the captured bandits said their leader was supposedly here now making some kind of deal with him, his eyes widen in realization, then narrow in anger.\n\n[color=#ff4949]— That incompetent bastard. First he fails to deliver on his quota, now he pulls this shit down on me!? I’ll have his balls in a vice for this.[/color]\n\nYou offer a solution, that if he tells you where you can find the bandit, you’ll take care of the problem for him. Provided, of course, he offers you some considerations in the future. You explain your plan, yet another layer to the deception, and wait for his answer. He thinks about it for a minute, beedy eyes narrowed in thought then nods.\n\n[color=#ff4949]— That sounds like it would work. Of course if I find a lynch mob from Shaliq coming my way I’ll make sure you suffer for it. How about I give you a discount on buying slaves from me in the future? I’ll also give you a token to let the guards know you’re trusted here.[/color]\n\nYou act as though you’re considering the offer, then accept. He tells you where you can find the bandit’s leader, just a short way into the woods. As you exit the tent, Cali gives you a look of admiration for your artful deception, and after you’re past the guards she pumps her fist.\n\n[color=yellow]— Yes! I can’t believe you pulled that off $name, that was awesome! Now all we gotta do is find the bandit boss, beat the crap outta him and find out where he found me.[/color]\n\nNow all that remains is to get the information you need. You may search after the bandit now, or return to your mansion to prepare.",
        "CaliSlaversNoOffer": "[color=#ff4949]— Well, why didn’t you say so in the first place? Well, usually I’d be willing to sell, but at the moment all my stock is committed elsewhere. If those fools I hired were worth a damn I might have something to offer. As it is I’m afraid you’re out of luck.[/color]\n\nActing disappointed, you shrug then tell him there was another reason you came to visit besides taking a look at his selection. Seeing his interest, you explain that you found out about his operation by overhearing some talk in Shaliq Village, and that he may have a problem on his hands.\n\n[color=#ff4949]— What do you mean I have a problem?[/color]\n\nDespite his obvious irritation, your serious tone seems to have caught his attention. You explain that you had recently been by Shaliq village, where you overheard an interesting tidbit in the local inn. Over the next several minutes you weave together a convincing story that the residents of Shaliq had caught several members of a bandit gang that had been raiding nearby farmsteads, and after questioning them they had claimed to be working for him.\n\n[color=#ff4949]— What!? That’s ridiculous. I never ordered any attacks on farms, and I certainly have no interest in kidnapping little human girls.[/color]\n\nAfter you explain that the captured bandits said their leader was supposedly here now making some kind of deal with him, his eyes widen in realization, then narrow in anger.\n\n[color=#ff4949]— That incompetent bastard. First he fails to deliver on his quota, now he pulls this shit down on me!? I’ll have his balls in a vice for this.[/color]\n\nYou offer a solution, that if he tells you where you can find the bandit, you’ll take care of the problem for him. Provided, of course, he offers you some considerations in the future. You explain your plan, yet another layer to the deception, and wait for his answer. He thinks about it for a minute, beedy eyes narrowed in thought then nods.\n\n[color=#ff4949]— That sounds like it would work. Of course if I find a lynch mob from Shaliq coming my way I’ll make sure you suffer for it. How about I give you a discount on buying slaves from me in the future? I’ll also give you a token to let the guards know you’re trusted here.[/color]\n\nYou act as though you’re considering the offer, then accept. He tells you where you can find the bandit’s leader, just a short way into the woods.\n\n[color=#ff4949]— Make sure to stop back after you’ve handled that problem for me. I’ll cut you a good deal on a new pet.[/color]",
        "CaliSlaversFightWinTogether": "In short order Cali has the slaver beaten within an inch of his life and restrained. It doesn’t take long for him to reveal the bandit you’re looking for is nearby, having set up a tent in the woods by the crossroads. Cali knocks him out afterwards and you carefully rebind her and lead her out of the slaver’s camp.\n\n[color=yellow]— Yes! I can’t believe we pulled that off $name. Now all we gotta do is find the bandit boss, beat the crap outta him and find out where he found me.[/color]\n\nYou may search for the bandit leader now, or return to your mansion to prepare.",
        "CaliSlaversFightWinWithout": "In short order you have the slaver beaten within an inch of his life and restrained. It doesn’t take long for him to reveal the bandit you’re looking for is nearby, having set up a tent in the woods by the crossroads. You knock him out afterwards and you quickly make your way out of the encampment.",
        "CaliStrayBanditFind": "As Cali and you approach the small camp, she becomes visibly excited at the prospect of finally finding out some information that might lead her to her home. You manage to get a view of the bandit without being seen, and Cali gives you a confident nod.\n\n[color=yellow]— Yeah, that’s him. There’s no way I’d forget that ugly face. C’mon, let’s get this over with.[/color]",
        "CaliStrayBanditWin": "After Cali managed to beat the bandit to within an inch of his life, you begin questioning him. You manage to find out a number of things,including where he stashed his loot. Most importantly though, he eventually tells you that he found Cali wandering several miles north of the [color=green]Far Eerie woods[/color]. Worryingly though, he tells the two of you that the area had been picked out for additional raids recently. After scouring the camp for valuables, you set off.",
        "CaliBadEnd": "You barely manage to keep up with Cali as she darts through the undergrowth. As you enter a clearing though, Cali suddenly stops.\n\n[color=yellow]— Mom? Dad? Is...is anyone here?[/color]\n\nThe reason for Cali’s frightened voice and shocked expression is pretty clear. Just within the clearing lay the burned-out wreckage of what used to be a small home. Knowing what she’s likely to find, you slowly walk around the clearing while Cali frantically pulls at the burnt timbers. You aren’t surprised when your exploration of the clearing reveals a pair of corpses. One is that of a male beastkin wolf, while the other is a human woman. You sigh, then call out to Cali. As she comes up to where you’re examining the bodies, her eyes widen.\n\n[color=yellow]— Oh no...I…I was too late. Why? I tried so hard, they...they can’t really be dead can they?[/color]",
        "CaliBadEndComfort": "You step forward and silently put your arms around her. After a moment she turns to you and starts crying, burying her face in your chest.\n\n[color=yellow]— Why? I...I tried so hard to come home. Why did they have to die?[/color]\n\nYou just stroke her head until she finally stops crying. It’s a shame you couldn’t get here sooner, but what’s done is done.\n\nEventually, she looks up at you, eyes puffy from crying.\n\n[color=yellow]— I...what do I do now? They’re dead and I’m….I’m all alone now.[/color]\n\nYou consider the matter. At this point she’s particularly vulnerable to your suggestions and there are a number of things you could do with her.",
        "CaliBadEndStay": "There’s little to be done in a situation like this. You step back a bit and wait, watching as she extolls her parents to get up. Finally, the truth sinks in and she collapses, sobbing from the bottom of her heat as she admits to the fact of her parent’s deaths.\n\nEventually, she looks up at you, eyes puffy from crying.\n\n[color=yellow]— I...what do I do now? They’re dead and I’m….I’m all alone now.[/color]\n\nYou consider the matter. At this point she’s particularly vulnerable to your suggestions and there are a number of things you could do with her.",
        "CaliStay": "You tell her that it’s fine and that she can stay with you for as long as she wants. She gives you a grateful look, then scrubs her eyes.\n\nAfter several hours you bury her parents and return to the mansion. It may not have been a happy conclusion, but Cali seems to appreciate what you’ve done for her. After the death of her parents, she appears to have lost some of her confidence and assertiveness, but her faith in you has grown a lot and she seems willing to do whatever you ask of her.",
        "CaliSlave": "You think for a while, while Cali seems to grow more nervous. Finally you tell her that if she is willing to swear absolute servitude to you, you’ll consider it. If she promises that she will be obedient, won’t cause any trouble and will do anything you ask of her, you will offer her a place in your household. She swallows, then nods.[color=yellow]— I’ll be a good servant...$master.[/color]\n\nIt may not have been a happy conclusion, but Cali seems to understand her place. After the death of her parents, she appears to have lost some of her confidence and assertiveness, becoming more passive than she used to be. She has become one of your more obedient servants, never forgetting that you are now her Master.",
        "CaliPlaythingSuccess": "You finger the Amnesia Potion you found in the bandit leader’s camp, then withdraw it. You tell Cali that if the pain is too much to bear, there’s something she could do. She listens, then looking over at the bodies she nods.\n\n[color=yellow]— I...if it will make me forget all this. I’ll do it. From the beginning I guess I was just going to end up as someone’s plaything. I’d rather it be you than someone else. Just...promise you won’t throw me away.[/color]\n\nYou nod and Cali takes the potion from you. Closing her eyes she drinks the potion down in a rush. As she opens her eyes, the empty bottle slips from her fingers to the grass below. Her empty eyes and blank expression are all you need to confirm the impact of the potion.\n\n[color=yellow]— Who are you?[/color]\n\nYou explain that you are her Master and that she belongs to you.\n\n[color=yellow]— What are we doing here Master?[/color]Smiling, you take her hand and lead her away from the corpses. While you walk, you explain that you brought her out here to explain her duties and teach her what pleases you. After you are a ways away, you tell her to remove her clothing, to which she immediately complies. As she stands naked before you, you tell her her sole purpose in life is to bring you pleasure with her body. For the next several hours you instruct her in how to pleasure you with her hands and mouth, with her pussy and her ass, until her body is stained with your semen and your seed trickles down her thighs. \n\nCali is left a broken mess, more animal than human. Nothing remains of her old personality and all she knows is how to serve her master with her body.",
        "CaliPlaythingFailure": "She looks at you in shock and revulsion.\n\n[color=yellow]— My parents are dead and you...you want me to become your plaything?[/color]\n\nWithout another word she takes off, never looking back. You shrug as she disappears into the woods. It’s a shame, but she was never that loyal to begin with. You poke around the ruins for a time, hoping to find something the bandits left behind. Pocketing the few trinkets you happen across, you return to your mansion.",
        "CaliLeave": "You look around the scene. The burned house, the dead bodies of her parents and the half-kin girl you spent all this effort for. At that moment you decide it. That’s it. You’re done. You did what you said you would and helped Cali find her parents. It’s not your fault they’re dead and you’ve wasted enough time and effort already. Without saying another word, you leave the girl to her own devices. She can be a thief or a whore for all you care. All you know is that your part in this is over.",
        "CaliGoodEnd": "As you approach a clearing in the forest you come across a lone house. Apparently Cali has been already spotted by her parents, as two figures leave the building and rush to the returning girl. A beastkin male and human female with which Cali share some resemblance. \n\n[color=aqua]— Cali! You’re alive, thank the gods! We thought we’d lost you.[/color]\n\nAs they finally gather and reach each other, the three of them share a long hug. After they part, the man looks at you, then back to Cali.\n\n[color=aqua]— So Cali, who’s this person?[/color]\n\nCali looks over at you and grins, tail wagging furiously.\n\n[color=yellow]Mom, Dad, this is $name. $He’s been letting me stay at $his mansion and $he helped me find my way back.[/color]\n\nThe man and woman both give you an appraising look. After a moment, the woman raises an eyebrow and looks at Cali.\n\n[color=green]— So you’ve been taking care of our daughter? I hope she hasn’t been too much trouble.[/color]\n\nYou assure her that Cali’s been fine, and proceed to explain all that’s happened while Cali was missing. Both of her parents seem impressed, and pleased that you managed to help her find her way home.\n\n[color=aqua]— That’s quite the tale. Escaping from slavers, being rescued from the city guards, then managing to track us down after taking out an entire gang of bandits. Not to mention getting here just in the nick of time. Is there anything we can do to repay you?[/color]",
        "CaliGoodEndNoReward": "You shake your head and explain that you were just keeping your promise. Seeing Cali reunited with her family is reward enough. Her parents seem impressed with your probity and tell you that if there’s anything their family can do for you in the future, all you need to do is ask. You leave Cali and her family to clean up from the bandit’s attack and feel a sense of satisfaction from a good deed accomplished. ",
        "CaliGoodEndNoRewardReturn": "It’s been a week since you returned Cali to her parents, and as you settle in for the night you think about the young half-kin girl. Sure, she might not have been the most beautiful girl you’ve met, but she was brave, hardworking and outspoken, traits that are all too uncommon. Suddenly you hear a bit of a commotion from downstairs. You head down, then blink in surprise.\n\n[color=yellow]— Um...hi $name. I was wondering, well...It’s just...I mean, I talked to my parents about it and...Argh! Why is this so hard![/color]Cali takes a deep breath then meets your eyes squarely.\n\n[color=yellow]— I think I love you, $name and I want to stay with you. I don’t mind being your servant, or even your slave. I know I’m not very experienced, but I’ll do anything you ask me to. I’ll fight for you, or gather food or...or bear children for you. Please...just let me stay with you.[/color]\n\nYou smile and ruffle the hair on Cali’s head. You’re glad she’s back and tell her so. As Cali follows you back up to your room, you grin. After all, she did say she’d do anything.",
        "CaliGoodEndReward": "You tell Cali’s parents that if they really want to reward you, anything would be fine. After all, you were mainly doing this as a favor to Cali. It’s not like you expected a reward. After some consultation amongst themselves Cali’s mother goes into the house. A few minutes later she returns.\n\n[color=green]— I know it’s not much after what you’ve gone through, but here.[/color]\n\nShe hands you a small case. Inside is a number of carefully labeled potions.\n\n[color=green]— My father was an alchemist and he left me with a number of useful potions. Maybe these can be of use to you.[/color]\n\nYou thank her, and give Cali’s hair a ruffle. When you get home, you’ll take a look, but for now you just say your goodbyes. Cali and her mother both give you hugs, while her father shakes your hand and promises never to forget what you’ve done for them. When you eventually return to your mansion you inspect the potions Cali’s mother gave you. You can tell a couple of them are expired, but it’s actually a rather good assortment. There’s a couple of stimulant potions, three tonics of hair growth, an elixir of youth and perhaps most impressively, a potion of oblivion. You’ll miss having Cali around, but are pleased that you could manage to keep your promise to her.",
        "CaliGoodEndKeep": "You think to yourself for a while. You’re happy that Cali was reunited with her family, but will miss having her services in the mansion. Despite her snark, she was actually pretty useful to have around. Nodding to yourself you ask if they would mind if Cali continued to work for you. If she’s willing, you promise that you’ll let her visit whenever she wants.\n\n[color=aqua]— Well Cali, it’s up to you. What do you think?[/color]\n\nCali looks at her parents then shrugs.\n\n[color=yellow]— I don’t mind working for $name, I mean, that’s what I was doing before anyway. And, well, I guess I do owe $him for all this.[/color]\n\nShe turns to you and gives you a wink.\n\n[color=yellow]— Let me just spend some time catching up with my parents and I’ll come back to the mansion, kay? I know you’ve probably got some [/color][color=pink]work[/color][color=yellow] for me to do when I get back[/color]\n\nCheeky brat. She actually wanted to come back and that wink and look she gave you tells you just what sort of “work” she has on her mind. A few hours after your return, Cali shows up at the door.\n\n[color=yellow]— Hey, I’m back and I’m ready to do whatever you want me to...$master.[/color]",
        "CaliProposal": "As you are about to move to the bed, you spot Cali near your room, who apparently was waiting for you. She looks rather nervous but after seeing you, she seems to gather her courage and approaches you. \n\n[color=yellow]— H-hey, I've been waiting for you. I wanted to thank you for taking care of me and also not letting that guy at the bar do anything to me. I never did anything like that with anyone, and that was kinda scary when he asked for it. I mean, I want to try it someday, but not like that... [/color]\n\nCali suddenly becomes quiet with her face getting redder as you observe her. Finally she finds the right words.\n\n[color=yellow]— I actually wanted to say, that I've been thinking a lot about you lately, $name. There wasn't anyone who cared for me like you, besides my parents. I think, I really like you, and... well...[/color]\n\nYou can't help but appreciate her boldness despite how obviously ashamed she is. You decide that it's time to stop the girl torturing herself over you.",
        "CaliAcceptProposal": "You tilt your head forward due to Cali's small stature and connect your lips to hers, giving her her first adult kiss. As your lips touch, her ears twitch and pupils widen, until she decides to close her eyes. While gently savoring her delicate mouth, you decide that at this point it would be better to move into your bedroom. You give Cali a small sign and the wolfgirl obediently enters your chambers. You close the door behind her, to make sure nobody will interrupt your intimacy.\n\n[color=yellow]— Wow, that's a huge bed. I think my mom and dad's was smaller at home. Oh, sorry, sometimes I get distracted easily. Um... what should I do... $master?[/color]\n\nAn unusual, submissive word from Cali makes you smirk at the thought of her trying to please you. As you sit down on the bed, you motion the wolfgirl to join you. She readily complies moving towards you. Sitting next to each other, you take initiative and return to what you recently stopped on the other side of the door. As you gently ease your tongue into her mouth, Cali awkwardly tries to accustom to the new experience. As she passively responds back to your kisses, you begin to strip her clothes from her.\n\nAs her body becomes exposed, Cali blushes even harder, which quite contrasts with her usual cheeky attitude. Noticing you closely inspecting her, the wolfgirl meekly speaks.\n\n[color=yellow]— Uhm... sorry, for not being much to look at. [/color]\n\nRealizing that she misunderstood your actions, you quickly reassure her that you are quite happy with her form. Trusting your words, she succumbs as you push the young girl down and go over her chest with your mouth. Cali puts up a minor resistance by putting her hands over your head as you tease and gently bite the aroused nipples of her nearly flat chest. As she begin to acclimatise to the new sensations, her breathing gets accompanied by meek moans. You attempt to place your hand over her crotch only to realize it's been covered by her bushy tail. Getting past that, you confirm she's already wet. After pushing her tail aside and taking a look at her tight virgin slit, as she dazedly watches you inspect her, you decide that it's time.\n\n",
        "CaliProposalSexMale": "After preemptively warning her, you pull out your already rock-hard cock, which she observes in awe, and position it over her pussy. As you take her hands into yours and take in her face, she gives you a broad, ready smile. Taking the opportunity you forcefully penetrate her in one quick thrust. With her hymen torn, her incredibly tight pussy willingly takes your cock inside, eased by its wetness. Cali's pained cry briefly fills the room, calming down as your minor pain-absorption spell makes her feel better. While still connected, you hug and kiss the wolfgirl to which she reacts almost blissfully. After explaining to her that you’re going to move now, and getting a confirming nod back, you begin to slowly move in and out of her tight hole. \n\nAlmost forgetting about the recent pain, Cali seems to focus on you and your movements, trying to adapt her little body to your pushes. The wolfgirl's pussy seems to be getting better at taking your cock, with each thrust making her moan in pleasure. Each thrust feels like you’re shaping her recently virgin slit into your new personal hole. As pleasure overwhelms her, you set yourself to trying to cum in unison, increasing your speed almost neglecting her small stature. Finally feeling the approaching orgasm, you seal her lips with one last passionate smooch. As you fill her womb with your hot seed, you can feel her inner walls tightly spasm around you due to her own climax. After a couple of moments lying breathless on Cali you finally pull out, letting seed flow from her.\n\n[color=yellow]— I'm really glad you was my first, $name. That felt amazing... can we do it again some other time?[/color]\n\nShe looks a bit puzzled as you laugh in response, but still hugs and affectionately kisses you. Still naked you both fall asleep. ",
        "CaliDenyProposal": "You give Cali's head a gentle pat and say, that you also like her and you will be watching out for her, until her parents are found. She shows relief, but you can spot a disappointed tone in her reaction."
    },
    "guildFairyQuestTexts": {
        "GuildFairyMainQuest": "You decide to address your little tutor regarding your recent mage's order request.\n\n[color=yellow]— No, I'm not for sale, silly! Bet you are disappointed, hehe, but I'm part of the establishment. You want to know more about fairies like me? They are fairly rare and expensive. If captured from the wild, they require complex training to be able to serve on par with other slaves, so usually rich people buy them for their exotic value. I've been educated and trained since a very young age, so I guess that would make me pretty expensive! *giggles*\n\n— Yeah.. you could try your luck outside near the elven and far parts of the local forest. Wild fairies can occasionally be met there, but capturing them is on you. Be careful, I will be sad if something bad happens to you, $name![/color]"
    },
    "amberguardQuestTexts": {
        "AmberguardShuriyaVisit": "You enter a fairly spacious and cozy, if messy, house. The shelves and tables are piled high and cluttered with various scrolls, potions and herbs, leaving very little empty space. With your experience you notice an unusually high amount of raw magic in the air. The female drow turns to address you, indicating that your presence hasn't disturbed her.\n\n[color=yellow]— You can call me Shuriya. Don't pay mind to the folk who call me  a witch or something like that. I just prefer solitary life and a quiet place to dabble in alchemy a bit. Nothing of concern, unless the Order has now outlawed that too?\n\n—  So, what brings you all the way out here?[/color]",
        "AmberguardLog1": "[center]Guard Officer Log[/center]\nWithin the ruins of an old watchtower you find the burnt remains of a journal. Most of the pages crumble at your touch. Of those that remain only a few remain comprehensible.\n\n5pm. The recon team has just returned from their mission. Surprisingly, they seem to be eager to make their report. After leaving their horses in the stables, they quickly made their way to the central command. Hopefully, today's mission has born fruit.\n\n6:45 pm.The enemy has been spotted around the city's outskirts. An unusually swift attack by them has been stopped by the numerous traps placed around the town. There is no sign of them giving up and more attacks are expected at any time.I sent a request for immediate support and yet another one few minutes ago, but I'm afraid we won't be able to hold for long.\n\n6:00 am. The assault has continued throughout the night, we received reinforcements in time allowing us to force the elves out from a breach and seal it. We may holdout still.",
        "AmberguardLog2": "[center]City Commander Log[/center]\nToday's mission is of utmost importance, our recon team will be infiltrating the enemy's latest research lab. Our  spies report that there is potentially a vital piece of research that may change the balance of the war. They also provided a one-chance route to get in and retrieve it with relative safety. I can only hope this is not a trap, but the reward far outweighs the risk. This war has been going on long enough and any potential breakthrough will help to save thousands of lives.\n\n…\n\nThe recon team has returned a couple of minutes ago, I've sent them directly to the Order. As usual the elves have been extremely cautious and protected their discoveries with magic, but it shouldn't be a problem for the Order's decryptors.\n\n…\n\nThe Elves have attacked again and this time they came close to destroying the outer wall. The city has been surrounded, the elves moving in shortly after the first strikes. I've managed to send a messenger through their lines to the nearest town. Given how relentlessly they are proceeding with the siege, we may be able to hold out a few days at best. There's no doubt that this strike is retaliation for what we stole from them.\n\n…\n\nThey are relentless, most would have retreated and settled in for an extended siege by now but they keep throwing bodies at the wall. They must be desperate to retrieve our findings. This gives us hope that what we have is even more vital to our survival than we thought.",
        "AmberguardLog3": "[center]Order Master Log[/center]\nAfter all the setbacks we have faced, we’ve finally done it. We have in our hands the solution to ending the war. The Thaumic Obstructor can easily affect an area roughly a square mile and is especially effective against those who are magically gifted targets. It's ironic that they were the ones who designed this device. Once we get through the schematics’ encryption and defences, we'll be able to develop additional protection for ourselves and render whole squads of their troops ineffective.\n\nIt is clear enough that they are well aware that we were stole their schematics and are launching ferocious attacks against our outposts already. Thankfully we prepared for such, and as a result they have suffered a great number of casualties. It is vital that we pass on our findings to the other members of the Order and to the rest of humanity. As long as we have enough time, we should be able to get word out. \n\nMiraculously our walls still stand. Reports from the walls report the elves have retreated back to a safe distance but still surround the city. I do not for one minute think this is over. Too much is at stake."
    },
    "GornQuestTexts": {
        "GornBar": "Tucked away just off the main street you duck into a sleazy bar. The air within is cool, a refreshing contrast from the heat outside.\n\nThis dimly lit bar can be at best categorized as something in-between a tavern and brothel. Despite its nature it is busy, the long hall filled with seats and booths, each partly separated with curtains. The bar hosts many strangers of all sorts, while small rooms at the back allow those willing to pay a place to retire for a time. A few gals serve customers and keep them company at the counter, perhaps offering additional services or just flirting.",
        "GornAydaReturn": "You find Ayda at her usual place, researching some texts, as her helper cleans around the shop. ",
        "GornAydaTalk": "[color=yellow]— I don't really care about what's going on around as long as I'm safe and nobody interrupts my works. Alchemy is just something I do so the Palace will play along with my demands and nobody pushes me around for not obeying the authority and traditions, marrying some imbecile because that's what dark elf women do, or whatever. \n\n— In case you were wondering, I'm actually far more interested in species research. Life and sentience has a very broad way to present itself and that has interested me for a very long time, so with some extra help I'm able to roam around and gather lots of information. Very few people actually care about things like history or how everything came to be as it is now, but at least some might find my works helpful in the future. [/color]",
        "GornAydaTalkMonsters": "[color=yellow]— Oh yeah, I've been studying the less humanoid races and their behavior. It's nothing surprising really: people can only rise from a community of other people. The more primitive the community, the less children are able to adapt, so in some cases even the ability to talk is a lot to ask. This is more a young brain's ability to learn much more at earlier stages, so a grown-up entity will have incredible hardships adapting to a more complex society. \n\n— I've found only one solution to this - reverse an entity's mind back to its very young stage, retrieving back the ability to adapt to new surroundings. This is not the most elegant solution, but if you really need someone to be able to not freak out in a city, that will probably be your only solution. I can sell you the recipe, but that won't be cheap. \n\n— As for re-education I suggest you see the slaver's guild. As far as I know, they do have some specifically designed schools, at least around human dominated cities.[/color]",
        "GornYrisMeet": "Approaching the girl it becomes obvious she is of feline origins She playfully invites you to share a drink. While her posture and movements show a lack of refinement, she has an appealing allure. Her short, cream colored fur, makes her stand out in the darkness of the room. She gives you a generous smile, her green eyes giving off a playful spark. \n\n[color=yellow]— Pleased to meet you. You can call me Yris. What’s your name? [/color]\n\nAfter telling Yris your name, you inquire about her business here.\n\n[color=yellow]— Oh, this is just my kinda place. Interesting people come and go and the booze ain't bad either. But I get what you are wondering about. Sorry, I'm no hooker, even though many would love to be able to pay their way into my pants. *giggles* Providing sex for money is just plain boring, where’s the challenge in that, and you have to deal with all sorts of unpleasant people. I have spades of stories from an unfortunate friend. Instead, I only play with prey I like. [/color]\n\nWith that, Yris gives you an intriguing glance, lasting just long enough to make you slightly nervous.\n\n[color=yellow]— Speaking of playing, $name, you appear to be quite unlike most who come through here, aren't you? Do you like to gamble? I enjoy placing bets on things I can personally participate in. I’d like to suggest you one of my favorites.... We go somewhere nice and private, and if I make you cum by any means in under 5 minutes, I win. In that case, I take 200 gold from you. Otherwise, you get 200 gold from me, or you get to use me until you are satisfied. But beware, I'm pretty confident in my skills. *giggles*[/color]\n\nAfter a brief consideration weighing the odds, you feel that bet could go either way.. 200 gold for 5 minutes of action is probably 10 times too much, but as a gamble, it has a certain appeal. ",
        "GornYrisAccept1": "After you agree to the bet Yris nods to the barkeeper and he passes her a key to one of the private rooms. With an eager expression she leads you into the back room. After directing you to the large armchair, she takes a couple minutes to prepare herself and returns back wearing only black, laced underwear, nicely contrasting against her light fur.\n\n[color=yellow]— Alright, here's our judge. [/color]\n\nShe puts a medium-sized hourglass over on the shelf. You notice that it appears to have slightly more sand than might be usual for its size. After seeing you are ready, the catgirl flips the hourglass and kneels down before you, quickly exposing your penis. \n\nWith her soft, semi-furred hands, Yris firmly grasps your penis, bringing it to erection in mere seconds. With a brief smirk, she patiently starts rubbing your cock and testicles in all different ways, all the while closely observing your reaction to each. Her ministrations are guided not only by her intuition, but also by her desire to win the bet. She is clearly trying her best to please you, and you can't help but respect her skills, as her actions 'investigating' what makes you respond are already very pleasant on their own. \n\nSoon she seems to be done with experimentations and with another brief smirk she quickly settles on a rhythm. You realize that Yris has worked out what is effective and now her hands tease your cock in just the right way, slowly building up in speed. What was very pleasant on it's own before, now has become incredibly pleasurable.You quickly realize that you need to resist if you want to have any chance at beating Yris, and gather all your will to try to stop your approaching orgasm, which briefly helps.\n\n[color=yellow]— He-he, you are quite an opponent. But we'll see if you can resist this... [/color]\n\nWith the built-up excitement spiking,she takes your cock into her mouth. The heat and dampness, along with your already heightened arousal, are quickly accompanied by Yris's rough cat-like tongue. With thirst she wraps her mouth and long rough tongue around your cock, giving you no time or chance to get accustomed to the new sensation. After only few thrusts you can't help but savour the climax overwhelming you, as she pulls out and lets you cum over her face.\n\n[color=yellow]— Oh, what a rich smell... Well, looks like I won! [/color]\n\nAfter a quick glance, you realize that the sandglass is only half empty and you probably never stood a chance in the first place. \n\n[color=yellow]— You held up pretty well too! Most guys blow before they get to even experience my mouth at all. I can see by your face, you enjoyed that didn't you? I wouldn't mind betting against you again, you know, so if you wanna have a second go sometime... *giggles*[/color]\n\nAfter Yris leaves with your money, you decide that a second time will most likely play out in the same way and trying to challenge her unprepared is a fairly dangerous proposition for your wallet. A few minutes later you return to the bar counter.",
        "GornYrisRefuse": "[color=yellow]— Aww... well, if you change your mind, you know where to find me. See you around, sweetie. [/color]",
        "GornYrisRepeatMeet": "You find Yris at the same spot. It seems she's still in the mood to challenge you. ",
        "GornYrisAcceptRepeat": "After showing the cash, Yris takes you back into the same room as before. Knowing your weak spots she quickly brings you to orgasm and milks you dry. After taking your money, she bids you farewell and offers to meet again. You decide that you should probably be better prepared  if you wish to attempt her challenge another time.",
        "GornYrisAccept2": "After Yris takes you to the same room once more and leaves you alone to prepare herself, you quickly gulp down the preemptively prepared Deterrent potion. Thankfully, as she returns, you begin to feel its effects kicking in. \n\n[color=yellow]— I was almost worried I wouldn’t get a chance to enjoy your company again. You ready, sweetie? [/color]\n\nAfter flipping the hourglass, Yris jumps you with her usual passion. Quickly going through her previous steps you realize that her attack is much more resistible under the effects of the potion. Noticing your composure, she switches to using her mouth. Her skill with her hands and mouth once again provide an incredible sensation, almost making you wish you had not taken the potion as its effect dampens the feeling. As you enjoy her mouth, her face starts to show mixed emotions of worry and growing arousal. \n\nYou pat her head as you notice, her hand periodically sliding into her panties to play with herself. Getting caught up in the action, you both nearly miss the sand in the hourglass running out.\n\nYris notices your smirk, she gives you a slightly troubled and shocked look as she spots the empty hourglass. \n\n[color=yellow]— Well... looks like you won, sweetie. What's your demand then? If you remember, we can continue, or…[/color]\n\nWithout letting her finish, you forcefully push her down and free her from the last of her clothing . Initially, you considered taking her money, but at this point  you can only think about fucking the catgirl in front of you. You see her eyes are also filled with desire, as you force her onto all fours and reveal her already moist pussy. \n\nPicking up on your intentions, Yris raises her hips eagerly, offering herself to you and gasps as your hard cock penetrates her. Wasting no time, you grab her soft, fluffy ass and begin thrusting in and out of her. With each move she cries out, enjoying every moment, begging you to fuck her harder. A few moments later her hole clenches tightly around your cock as she cums. Feeling your orgasm approaching as well, you don’t let up with your assault on her and pound her with increasing force, then finally release your seed into her loins. \n\nAt last you collapse next to her as you both recover from your encounter. \n\n[color=yellow]— Wow.. not only you are prosperous, but also have a beasty temper. That certainly makes up for the fact I lost. I would like to spend some more time together, but sadly, I gotta go. I won’t say no if you show up and challenge me again, sweetie. [/color]\n\nAfter giving you a gentle goodbye kiss, Yris gets dressed and leaves. As you prepare to leave yourself, you spot an object that has fallen behind the shelf. After picking it up and inspecting it, you realize that it's an ointment you haven't previously encountered. You quickly pocket the jar before leaving the room.",
        "GornYrisAydaReport": "You approach Ayda and ask her to take a look at the jar of ointment you found left behind in the back room. She takes the ointment from you, and after a few minutes returns with a report. \n\n[color=yellow]— Well it’s an interesting mixture. I’m pretty sure it’s a strong aphrodisiac laced with a tactile stimulant, but there is also something else special mixed in giving it a unique feel, probably pheromones. This appears to make you nearly irresistible to your partner for some time... Nothing dangerous from what I can tell, and since you have to apply it directly onto the target to be effective, you can safely carry it. As for your own skin, you could protect yourself from the effect with a weak foundation. You can take some, there’s a half-empty bottle on the counter if you need it.[/color]\n\nAfter a brief contemplation, you thank Ayda and take the foundation.",
        "GornYrisOffer2": "You spot Yris seated at her usual place, but today she looks a little different.\n\n[color=yellow]— My favorite play partner is here! I'm really thrilled to see you after last time, you know... So since we both scored, how about we raise the odds? One thousand gold, 10 minutes to get you off. A little birdie told me that your pockets are a little deeper than you let on, so that shouldn’t be a problem for you? So, what do you think? Tempting, right?[/color]",
        "GornYrisOffer2Repeat": "You find Yris at the usual spot. It seems she's still in the mood to challenge you. ",
        "GornYrisAccept3": "Yris shines with confidence and grins hearing your answer. She eagerly escorts you away and proceeds to go through her normal procedures, leaving you alone as she prepares. You quickly apply the foundation you took from Ayda all over your groin, while gulping down another deterrent potion. A slightly larger hourglass is brought forth and after asking for your confirmation, Yris quickly gets into action. This time you spot that her hands are slightly moist, from what you had thought to be just water from the bathroom before. As things proceed much like before, you notice how much more clearly you can think about the things happening. Yris is still very attractive and skillful in her play, but the previously experienced urge to take her above any reason is gone. \n\nTo avoid raising any suspicion you act like you are constantly on the verge like before: after all this is a bet. Yris has now switched to using her mouth and accompanies it with a titjob. While she eagerly works on your cock she keeps a nervous eye on the hourglass as the sand gets lower and lower. Holding back takes some effort, but you expect you can hold out till the end... \n\nAs the sand reaches around 1/4 of what is left in the hourglass, Yris gets even more nervous and hurriedly drops her panties, swinging her legs over as she mounts you. You’re not completely sure if it's her own drugs getting to her,  her desperation to win, or if she simply gets horny easily, that drives her on as you are embraced by her wet pussy. You lay back into the armchair, as she moans sweetly while she begins to ride your cock in earnest. This pose brings about a new sensation, making it harder to hold back. Yris does not seem to have much experience in this, but her effort greatly makes up for it, steadily bringing you closer to the edge. Thankfully, the sand runs out just a bit before you'd have to cum, making you think that if she'd started with this, you could easily have lost. \n\nYris sits astride you, your cock still buried within her, as a deep red blush overtakes her,  unable to believe she has lost to you again. Despite her blushing her eyes show no fear.\n\n[color=yellow]— Wow... you beat me again. Are you going to fuck me like before?... [/color]\n\nDespite her suggestive question, you don't really feel like that would be worth it.",
        "GornYrisReveal": "You reveal everything to Yris, the things you discovered and your preparations before the bet. She is both shocked and amazed by you at the same time. \n\n[color=yellow]— Who would've thought you would crack my secret and in so little time... and then turn the tables using my own tricks against me. Please don’t tell anyone, it will ruin my reputation and make it harder to get by, and a few people might try to get back at me.\n\n— It's been a bit rough for me since I moved here. Getting work is also hard, especially when you look so out of place. I found that some people were only interested in me for my unusual looks. Others showed little interest or rejected me. Many of these were willing to take up the offer and despite their lack of feelings I was still able to make them ejaculate. \n\n— Actually, the first bet was offered to me, and I was on receiving side. I was taken away by how thrilling it was and from then on decided I would try to pay my bills this way. This was both fun and enjoyable, and even though I only offer it to those who I find attractive, many take up the offer. I also got into gambling, but cards and sport bets have nothing on this. Eventually, I found a way to make my chances more... secure. Since that mixture made the very few people who won against me too horny to ask me for the cash. There's no rules against anyone using anything, and they still agree that there's an option they might take, so nobody was disappointed. \n\n— Then, you showed up. The first time was just fun and you held out well, but then after the second time I thought I did not use enough ointment so you managed to win. After thinking it through, I thought that you'd be more confident after your last win, at least for the next time, and this could bring me a hefty prize. But I guess you outsmarted me in the end... Well, there was nothing against using side help in the rules, so that's only fair for me to accept your victory. \n\n— I'm sorry, I don't quite have the sum we were betting on, so I can't quite pay you back yet. I promise, I'll find some way to get the money, please just give me some time... [/color]",
        "GornYrisTakeGold": "You tell Yris you would rather have the one thousand gold which has been bet. She seems to be at a loss for words as she only can stare at you in surprise. \n\n[color=yellow]— O-okay... Just, please give me some time, I'll pay you in a week. I don't have it on hand, but don't worry.[/color]\n\nAfter gathering her belongings, she leaves you, sorrow all over her face. ",
        "GornYrisTakeGold2": "Yris gives you a sore look, but there's little she can do. \n\n[color=yellow]— I understand. I'll get it in a week or two, until then, goodbye. ",
        "GornYrisHire": "You suggest Yris joins your household. With the money she owes you, this gives her a sound way to pay you back, plus since she is already somewhat fond of you, this is not something terrible for her. After listening to your proposal, Yris sits down and slowly contemplates her options. \n\n[color=yellow]— This... would be quite a heavy penalty for such a loss, wouldn't it? But, I think I don’t have to many other options: you beat me at my own game, and I should accept this defeat. After all, you would be able to use me any day for not being satisfied this time and that's a fitting punishment for my loss. [/color]\n\nWhile it appears from her words that she's not very enthusiastic about it, you notice she in fact seems pretty happy with this outcome and is only trying to hide her true excitement. She stayed true to her nature and enjoyed every part of this game and how it played out, even in her loss. "
    },
    "chloeQuestTexts": {
        "ChloeEncounter": "You spot a lone gnome girl who seems lost. She takes notice of your presence and starts to panic, preparing to run away before you’ve even lifted a finger. It’s oddly refreshing to be feared without having to prove anything.",
        "ChloeEncounterGnome": "You spot a lone gnome girl who seems lost. She takes notice of your presence and seems to panic for a moment. She prepares to run away, but calms down when she notices another gnome in your party.",
        "ChloeSedate": "You quickly cast Sedation on her. She shoots you a puzzled look, blinking rapidly for several seconds until the magic has run its course, and she’s ready to talk.\n\n",
        "ChloeEncounterTalk": "[color=yellow]- Oh, uh, h-hello. I, uh, kinda thought you were some kind of giant, gnome-eating bandit for a second there. N-not that big people terrify me or anything![/color]\n\nShe coughs and rubs one of her arms, clearly embarrassed.\n\n[color=yellow]- Well... Actually I moved to a nearby village, but I just can't learn the surroundings, and keep getting lost. I'm just not used to all this open… Openness.\n\n- Say, do you happen to know the road? Could you help me out?[/color]",
        "ChloeEncounterRefuse": "- Oh, I see... Well, don't worry, I'll manage! Good luck then, see you around!\n\nSaying that, she quickly retreats, disappearing from sight.",
        "ChloeEncounterHelp": "[color=yellow]- Really?! Oh thank goodness, you’re a lifesaver, literally! My name’s Chloe by the way. Man am I glad I didn’t run away from you.[/color]\n\nShe seems genuinely relieved that you can show her the way.\n\n[color=yellow]- B-but don’t get me wrong, it’s not like tall people scare me or anything like that... A-anyway! We should really head back before it gets too dark.[/color]",
        "ChloeEncounterRepeat": "- Oh, it's you again! Ugh... Yeah, I kinda forgot the road again. I should really start carrying around one of those absurd round things with the pointy dealy. Looks like you know the way better than I do, have you figured out the roads yet?",
        "ChloeShaliq": "You lead Chloe back to Shaliq, as she tells you about herself. She's a researcher and inventor, came here for some inspiration and peace of mind.\n\n[color=yellow]- Thanks again $name! If you are interested, come see me around here. I may have something interesting for you.[/color]",
        "ChloeShaliqOffer": "Chloe invites you into her spacious hut, a variety of odd looking gadgets and tools are neatly arranged throughout her abode.\n\n[color=yellow]- Oh, hello! It's nice that you actually came! It's kinda never occurred to me that you’re a mage before.\n\n— I'm not all that into magic myself, but I’ve found some use for it. Wanna make a deal? Provide me with some mana, and I can share a spell an old friend passed onto me during some experiments I was running at the time.\n\n— It influences the target’s mind, letting you plant some serious suggestions. I’ve never really been into tweaking with other people’s minds, but I’m sure you could find plenty of uses for it. So how about it; 25 mana for the spell sounds fair?[/color]",
        "ChloeShaliqReturn": "[color=yellow]— You're back! So, how are you doing? Ready to help me out[/color]?",
        "ChloeShaliqTakeMana": "[color=yellow]— Great! Just stay right there for a moment![/color]\n\nShe leaves you alone for a moment to dig through her closet, eventually returning with an ordinary looking glass tube that has some sort of strange device attached to it.\n\n- Found it. I haven’t actually had the chance to use it before, but it should work. And, um… If you don’t mind, I can help out, I guess.\n\nDeciding to give her the lead, you follow Chloe over to a bench and take a seat. She carefully rubs at your groin, and with a surprised gasp, she frees your manhood, clearly intimidated by its size.\n\n[color=yellow]— I-I uh, guess it’s only natural that you’d be big in more ways than one...[/color]\n\nThe awkward little gnome takes hold of your penis, at first gently stroking your cock, and adjusting her hand movements and pressure to try to give you the most pleasure. Her innocence and cute looks are enough to keep you going, but it’s clear she won’t be getting you off with her lack of technique this way, a fact she seems quick to catch onto. With clear arousal and determination in her eyes, she adds her mouth into the mix.\n\nWith a hint of worship, the eager gnome dutifully attends to your throbbing member, stroking and sucking so you can reach orgasm much faster, and you’re more than happy to oblige and enjoy her efforts. With each movement she becomes just a little more confident, acting more and more bold, and you realize she’s observing you; looking at every little reaction and learning your sweet spots.\n\nAs you’re about to cum, Chloe pulls your cock out of her mouth, pushes it into the device she brought out at the start, and finishes you off with her hand. Your orgasm is no different from any other, but for once you feel yourself giving mana instead of taking it, as the device sucks the bounty into its storage.\n\nChloe gleams with joy, happily smiling as she runs off to put her new possession away.\n\n[color=yellow]- That will do... Now if you excuse me, I have some work on hand while it's fresh. Please, come again later![/color]\n\n[color=aqua]You have learned the Entrancement Spell.[/color]",
        "ChloeShaliqBusy": "- $name! How are you doing? Sorry, I'm a bit busy with a new research. But please come back some other time!",
        "ChloeShaliqMissing": "You knock, and go inside, but it seems there's nobody around. After looking around a bit you find a note left by Chloe, saying she went to the deeper parts of the forest. As it seems that she hasn't been around for some time, you decide it may be a good idea to look for her.",
        "ChloeShaliqMissingRepeat": "You already searched and couldn't find Chloe here.",
        "ChloeGroveFound": "After spending some time managing your way through uninviting flora, you come across a steep ravine. From above you spot traces of someone having gone through recently. As you move along it, you eventually spot a small shadow at the bottom of the ravine. Even though there's some noise, calling it out has no reaction and you decide to descend into the ravine.\n\nUnsurprisingly, the shadow turns out to be your old acquaintance Chloe. She is hardly recognisable, as she crawls half-naked on the ground. She barely recognizes you, being semiconscious, moaning and blissfully rubbing her bare crotch.\n\n[color=yellow]- $name?... You found me... I want you... Please, I can't... I can't calm down...[/color]\n\nAs the gnome girl raises up and stumbles your direction, she latches on you while rubbing her soaked thighs together.\n\n[color=yellow]- I... need relief... from you[/color]",
        "ChloeGroveSex": "You give in to the horny girl's temptations. With a blissful expression she pulls down your pants and lustfully strokes your cock, making it fully erect. As you lay down on the grass, she quickly crawls on top and clumsily begins to ride you with her soaking pussy. Her moans quickly grow louder and and her frantic movements indicate she’s close to orgasm.\n\nAs you both convulse in climax, she briefly faints on top of you. This makes you slightly worried, but a few nudges bring her back to consciousness\n\n[color=yellow]- We... should get out of here.[/color]\n\nNot wasting any more time, you help the still-woozy gnome to get out of the ravine and return with her back to Shaliq.",
        "ChloeGroveMasturbate": "You take the horny girl and place her small body on your lap, with easy access to her pussy. As you work through her folds, attempting to quickly bring her to orgasm, she turns to embrace you and gives you a sloppy, lustful kiss.\n\nAfter a few minutes Chloe finally reaches climax and regains her senses.\n\n[color=yellow]- T-thank you... we should leave this place now.\n\nWithout wasting any more time, you help the still-woozy gnome to get out of the ravine and return with her back to Shaliq.",
        "ChloeVillageHelp": "As you come in, you can see Chloe has regained her composure, although something about her isn’t quite right. Her face is bright red and she certainly looks restless.\n\n[color=yellow]- $name, thanks for saving me from there. That was embarrassing... letting you see me like that...\n\n- I can’t believe I fell into that damn hole. After a while I just got so hungry and ate some strange berries... Then I just couldn't think straight for days... I think there's also something in the air.\n\n- But that aside, I need your help. You see... I still can't calm down. It's not as bad as it was there, but I just can't concentrate on anything. I have a recipe for an antidote which should help. Can...can you make it for me? Please? I know you should have some equipment. Sorry for giving you so much trouble, but there's really nobody else I could ask right now.[/color]\n\nYou take the recipe from her and promise to return soon.",
        "ChloeHelpReturn": "You decide it's better not to needlessly disturb Chloe right now. ",
        "ChloeCure": "As you pass the antidote bottle to Chloe, she looks very relieved.\n\n[color=yellow]- Thank you, $name! You’re a lifesaver... again ![/color]\n\nAfter some time she completely calms down and you can see her relax.\n\n[color=yellow]- Can't believe it happened to me... I really owe you one, I guess. Um... how about this?[/color]\n\nShe spends some time looking through her stuff, until she finally finds an old looking scroll.\n\n[color=yellow]- This is supposed to be a dangerous spell, but you helped me, and I think you would use it responsibly. Take it. And... I wouldn't mind if you come see me again sometimes, if you aren’t too disturbed after seeing me like that.[/color]",
        "ChloeAmnesia": "As you pass the disguised bottle to Chloe, she looks very relieved.\n\n- Thank you, $name! I knew I could rely on you!\n\nAs she gulps down the potion, her face  becomes more relaxed.\n\n[color=yellow]- Huh... this has an interesting taste... What was I doing again...[/color]\n\nAs the amnesia potion starts to take effect, Chloe appears to be less and less conscious of the world around her. With her mind in such a vulnerable state, it’s a trivial matter to use your entrancement spell to implant a number of suggestions within her. As you lead her back to your mansion, you reflect on the irony of using the very spell she taught you to brainwash her.",
        "ChloeAphrodisiac": "As you pass the disguised bottle to Chloe, she looks very relieved.\n\n- Thank you, $name! I knew I could rely on you!\n\nAs she gulps down the potion, she looks slightly puzzled.\n\n- Huh... this is a different taste from what I expected...\n\nAfter a few moments she starts panting, the unquenchable lust in her body growing even wilder than it was before.\n\n- No way!.. I must have... Mixed up the formula... Ah!...\n\nAs her body explodes into orgasm, she's completely at a loss for words, only having you in her sight.\n\nAfter a few joyful hours you realize all of her free will has been replaced by wild desire. After a minor break you make a decision:",
        "ChloeBrothel": "You lead what’s left of the gnome girl to the local brothel. After some haggling, you make a deal for 500 gold, and leave her in the custody of the owner. It seems that her new occupation fits her animal instincts, making any further involvement on your part pointless.",
        "ChloeTakeSelf": "Sex-crazed Chloe becomes your servant.",
        "ChloeVisit": "Chloe happily greets you as you visit her and you spend some relaxed time together. It seems she grew very fond of you.",
        "ChloeVisit2": "During another visit, Chloe seems unusually happy. Your time together slowly grows into sex. As you lay together, she affectively offers to join your household. ",
        "ChloeVisitAccept": "With a happy look Chloe packs her items and moves to your mansion.",
        "ChloeEmpty": "This place is empty now. There's no point to return here anymore."
    },
    "aynerisQuestTexts": {
        "AynerisMeet1": "As you travel on one of the footpaths, you sense the presence of a group of people nearby. Cautiously moving forward, you come across a group of armed elves, lead by a young, luxuriously dressed woman. Perhaps, too young, to be in command of such a group. Upon spotting you she instantly reacts and yells to her guards.\n\n[color=yellow]— You! You’re the trespasser our peasants reported. You'll pay for the disgrace you caused to them. Get $him![/color]\n\nMany elven regions still utilize a feudal structure and it is likely that the girl is a member of a noble family responsible for this area. Despite your attempts to explain your presence and that they are mistaken, her squad is already moving to attack, leaving you little choice but to fight back.",
        "AynerisWin1": "With her escort chased off or knocked unconscious, you are left with the subdued elven girl. Despite her arms and legs being tied and no clear way to escape, she keeps struggling and showering you with anger.\n\n[color=yellow]— Let me go, you damn $race. You have no idea who you dared to attack! I'm Ayneris of the Stormbourn clan, you will pay for this! [/color]\n\nHer angry attempts to lord over you despite her current situation raises an urge to put her in her place.",
        "AynerisPunish1": "You pick up the noisy Ayneris and lay her upon a fallen tree. Despite being bound and having no way to defend herself from you, she continues to protest though there is a note of concern in her voice now.You quickly gag her mouth to stop the raising irritation. With her butt presented, you lower her pants, exposing her bright skin to the forest's air. \n\nHer muffled swears quickly stop as you deliver a heavy slap to her ass. Slowly delivering new spankings, you explain to her that she has mistaken you for someone else and this is her punishment for attacking an innocent bystander. With each slap she cries out through the gag, and even though her attitude seems to shift slightly, her eyes are still filled with anger when she looks at you. After another loud slap on her now bright red ass, you lower her pants even further and notice her pussy has become rather moist, which puts a smirk on your face. Despite Ayneris having little strength left, she manages to give another protesting yelp and attempts to jerk away as your fingers carefully enter her. Another heavy slap calms her protests and she lets you examine her virgin hole.\n\nCaptivated by the sight, you spend more time massaging her labia and clit, while still giving playful slaps to her ass. Quickly her sobbed moans begin to change and start to sound more and more lewd. Having reinforced your position over the elven girl, you increase the pace of your ministrations, bringing her to a sudden shame filled orgasm. Wondering if it's the correct thing to do, you loosen the bonds on her exhausted body and quickly leave, deciding she would bring too much trouble if taken with you.",
        "AynerisLeave": "You decide to leave the elven girl and retreat before someone else shows up and takes the whole situation in the wrong manner. Being well-known around here, you expect her to be found rather soon anyway.",
        "AynerisMeet2": "After making your way along another pathway, you encounter a familiar person: Ayneris, the noble elf girl you have previously encountered and defeated. This time her party is even larger and seems to be prepared for a fight.",
        "AynerisWin2": "Once again the elven soldiers are defeated and Ayneris lies tied up before you.",
        "AynerisPunish2": "You decide that the previous lesson needs an additional reinforcement and you quickly bring the struggling elf girl into a familiar position. With her naked butt in the air, Ayneris has no choice but to be spanked like a naughty child for a second time. This time, however, you carefully watch over her private parts and spot how quickly she turns wet after you strike her just a couple times. Her face, currently way redder than her ass, shows signs of concern as she notices your dirty grin. \n\nSinking your fingers into her virgin pussy makes Ayneris involuntarily moan in pleasure. She quickly realizes her mistake and tries to struggle, but you pay that no attention and gently caress her labia, contrasting it with rough slaps on her bum. Her quickly moistening crotch indicates how undoubtedly excited she is. You decide that this time you should punish her completely and not stop half-way through. Pulling your erect cock out causes Ayneris’ eyes to open wide in panic. She pleads with you not to do it as you line your cock up with her tight hole.\n\nAs you plow into her virgin elven pussy, the girl spasms with an unintelligible scream before falling limp from the intense orgasm, fueled by excitement from the foreplay. You tell her, this time you will be compensated with pleasure from her side. Grabbing her waist from behind, you begin to fuck her defenseless body. The heightened sensitivity after her orgasm quickly overrides the pain caused by the loss of her virginity, and to your surprise her moans quickly take on a familiar tone. After a brief consideration, you untie her legs and turn her onto her back, savoring her tear-soaked red face. A minor smear of blood coats your cock, indicating her loss of virginity. You give her a smug smile as you get closer to climax.\n\nRaising the pace, you notice how her moans suddenly change and her body trembles as you bring her to another involuntary orgasm. Right after that you pull out and shower her crotch with your cum. Ayneris's unfocused eyes seem to be unable to grasp the situation, so once again you untie her and quickly leave the area.",
        "AynerisMeet3": "After entering the local store, you spot a familiar figure, who instantly recognizes you. It is Ayneris, the elven girl of noble origins with whom you’ve had an interesting relationship, however she appears to be alone this time. She quickly rushes at you, raising her voice in anger. You quickly drag her outside to not attract any more unwanted attention. \n\n[color=yellow]— I can't believe you dare to show your face around here after what you did! [/color]\n\nShe takes a pause then her tone suddenly changes and she sounds like an angry child, who still wants something from her guardian. Her familiarity leads you to think, that your  \"discipline\"  has been taken unexpectedly positively. \n\n[color=yellow]— Actually, forget about it. I want to apologize for my past actions, if you let me. I know your name, $name, you are from the Mage's Order. I've learnt a bit about you after the last time. I want to join you. [/color]\n\nReacting with caution to her unexpected statement, you ask her to explain what's going on, before making any decisions.\n\n[color=yellow]— Well... you see, the Stormbourns have a lot of children and rather little in the way of possessions and wealth. I'm one of the youngest children and most of that is already claimed by my brothers. I thought, if I could prove that I'm capable of taking care of family's business and defending its people, I could at least achieve a better position, maybe take the place of one of my brothers. So after I had heard some rumors about a trespasser in one of our villages, I went to try to catch him, but found you instead…\n\n— So my plan fell apart, as you know. Now I've decided to leave and see the world, since all is better than be kept around out of humility. I think I’ve proven myself capable of standing up to most in a fight and I can be of use to you, and if you don’t let me go with you I'll yell so hard, that the guards will chase you all the way to the mountains![/color]",
        "AynerisOfferJoin": "You figure out, that not letting Ayneris join you is really not an option at this point, and cautiously invite her. \n\n[color=yellow]— Great! I'll be looking forward to my personal room![/color]\n\nWith a slightly mischievous smile, Ayneris disappears through the portal. ",
        "AynerisIgnore": "With a cheap distracting trick you quickly retreat. Thankfully, you've managed to get lost in the crowd before Ayneris could bring to much attention to you, but your reputation around Amberguard will surely suffer. ",
        "AynerisContinue": "In the morning, you meet with Ayneris. She seems to be very anxious for some reason. As per her usual manner, she boldly addresses you.\n\n[color=yellow]— Hey. $name, we must return to Amberguard. [/color]\n\nWith a puzzled look, you try to get more information from her. \n\n[color=yellow]— Someone must've stolen my weapon from me when I was there! I can't believe the fools have no respect for someone like me, from a noble clan. Anyways, I must take it back. So, we are travelling there and will not return without my rapier. [/color]",
        "AynerisRapierAgree": "Ayneris responds in a more elated mood. \n\n[color=yellow]— Fantastic! Just inform me when we are going, so I can make preparations.[/color] ",
        "AynerisRapierRefuse": "Ayneris looks somewhat shocked by your response.\n\n[color=yellow]— You what?! You don't understand the importance of this?! I can't believe I've wasted my time here with you![/color]\n\nAfter saying this, the elven girl lividly walks off. This leaves you even more nervous than before. ",
        "AynerisRapierAmberguard": "You and Ayneris walk into the main square. While doing so, she observes the surroundings with a determined expression. \n\n[color=yellow]— Hmph, look upon them, showing no awe towards me at all. These urbanites are nothing but trouble! I really should have been more vigilant in watching over it, follow me closely.[/color]",
        "AynerisRapierAmberguardCleaner": "After a few hours of running around the backstreets, you are surprised that Ayneris found some older man she recognized from the last time she was here. Judging by his appearance, he seems to be a poor manual laborer. After explaining the situation, in demanding manner, Ayneris receives his reply.\n\n[color=aqua]— I'm sorry M’lady, but my memory is not as good as it was in the past. I may have seen something, but it’s really hard to remember. You see, at times like this, a nice, vivid image makes this old brain work better. A glimpse of a young, beautiful body, such as yours, would certainly help. [/color]\n\n[color=yellow]— What?! Do you even know who you are talking to? If we were at my... Ah, forget it! Let’s go! This old fool knows nothing![/color]\n\nHowever, your intuition tells you this old elf indeed knows something. ",
        "AynerisRapierPay": "You decide to bribe the street cleaner instead and pass him a purse of gold. His reaction seems to be that of satisfaction.\n\n[color=aqua]— Oh, yes, M’lord... I remember it was at the culvert in the upper quarters, second street. I believe I saw it in the storm drain, but I couldn't get it in time. [/color]\n\nAfter listening, you and Ayneris leave for the given location.",
        "AynerisRapierShow": "As you would expect, Ayneris responds with visible outrage.\n\n[color=yellow]— Are you out of your mind!? I might have left my home estate, but I'm still from the Stormbourne clan and he's just a lowly, filthy peasant! A street cleaner! What if someone finds out?[/color]\n\nYou explain to Ayneris that likely nobody would believe him, even if he had proof. Besides, there's little harm in just giving him a view he won’t ever see again anyways. After a long consideration, she makes you promise to never speak about this to anyone. ",
        "AynerisRapierShow2": "Upon hearing Ayneris's agreement, you spot a faint smirk on the old man's face. \n\n[color=yellow]— So, you got it? Only the upper half, no touching. If your information is false, I will personally end you![/color]\n\n[color=aqua]— I'm not a fool M’lady, just give me some time for my memory to return. Then, I'm sure I will be able to help you![/color]\n\nStill doubtful, Ayneris removes her garments, exposing her breasts to the street’s breeze. She then quickly averts her eyes and with each passing second, her face gets redder.\n\n[color=aqua]— Mh-m, you are very beautiful indeed![/color]\n\n[color=yellow]— S-shut up and give me what we need! What’s taking so damned long?[/color]\n\nThe street cleaner slows his sentences. Obviously, he is dragging it out to gain more time enjoying the view. \n\n[color=aqua]— Ah yes! I feel like... I feel like I’m starting to remember... Yes... It was at the culvert in the upper quarters, second street. I believe I saw it in the storm drain, but I couldn't get it in time. [/color]\n\nAyneris quickly puts back on her clothing after obtaining the information she wanted. Still red-faced, she drags you by the arm and out of the immediate location.\n\n[color=yellow]— Darn that old leech! How come I get nothing but humiliated after just meeting you!? Quickly, let's get this over with. [/color]",
        "AynerisRapierFall": "After a few minutes, you find the foul culvert storm drain. Upon removing the grate and searching for some time, you spot a noticeable piece of metal lying in the far corner of the sewer. Ayneris witnesses your finding with apparent disgust. \n\n[color=yellow]— Hard to see from here... So, how are we gonna get it?[/color]\n\nMoving to get a closer look, Ayneris slips in the nearby puddle. Her body loses its balance and falls towards the direction of the opening.",
        "AynerisRapierCatch": "You reach out and grab Ayneris’ hand. However, her panicked struggles make you lose your balance as well and you both drop into the opening. After a few moments, you both smash on the slimy sewer floor which covers you in feces. Ayneris seems physically unharmed, but is appalled to the point of only speaking in curse words. Ignoring her for a moment, you quickly grab the metal piece. After making sure it's what you are looking for, you show it to the soiled elf. \n\n[color=yellow]— You oaf! Get me out of here immediately![/color]\n\nDespite her current reactions, she seems to recognize your finding. You then begin to hastily climb out of the sewers, while covering your noses. A couple more times Ayneris nearly slips, but eventually you make it out to the streets. \n\n[color=yellow]— Now get us away from here before anyone sees us. I swear, this is the worst day of my life![/color]",
        "AynerisRapierCatchContinue": "After returning to the mansion, Ayneris quickly runs to the bathroom and isn’t seen for the rest of the day. Thankfully, her sword seems to be doing better than she is.",
        "AynerisRapierIgnore": "Ayneris' wild flailing didn’t stop her from falling. After a moment, a loud splash is heard from the sewers. Being covered in feces, Ayneris quickly jumps up and looks up at you with a face full of rage and tears. \n\n[color=yellow]— What the hell you BASTARD, why didn't you attempt to catch me?? Oh my God, it smells horrible![/color]\n\nAfter releasing all the swear words she knew, Ayneris finally got ahold of herself and located the desired piece of metal a few steps away from her. You then carefully help her out, to which she reacts with no relief.\n\n[color=yellow]— Now get me away from here before anyone see us. I swear, this is the worst day of my life![/color]",
        "AynerisRapierIgnoreContinue": "After returning to the mansion, Ayneris quickly runs to the bathroom and isn’t seen for the rest of the day. You feel like her bad mood will not disappear like the crap she washed away though."
    },
    "sebastienQuestTexts": {
        "sebastianumbra": "You explain to Sebastian, that you are looking for alternative options for selling slaves and wondering if he can help you make a few new connections.\n\n[color=yellow]— Looking for new options, pal? I suppose I could take some troublesome slaves from you, but I will be straight up with you: I won't pay you much, also word about it will quickly spread and people won't be pleased. You don't care about your reputation? I might have another option for you, it will be difficult to arrange... Fine, I'll pass you an exclusive ticket. Just come see me once you have enough money.[/color]\n\n[color=aqua]You can sell slaves to Sebastian now. Slaves sold this way will grant upgrade points even if they are not tamed properly, but this will lower your reputation. [/color]",
        "sebastianumbra2": "After slipping the money to Sebastian, he quickly checks the area for any possible witnesses before passing you the teleport stone.\n\n[color=yellow]— Don't you dare tell anyone where you got this, I’ve just started to form a good reputation and I don't like my efforts going to waste. In Umbra you will encounter outcasts of every kind you can imagine and a whole bunch you can’t, so keep your eyes open. There's plenty of security and unwritten rules to keep the peace, but given the nature of the place scuffles do break out on occasion.You should resist the temptation to visit any more than you need to. You will find plenty of opportunities there, but in case something happens I will deny any connections to you. Now, thanks for the business and good luck, $name. ",
        "UmbraFirstVisit": "You address one of the patrollers monitoring the area and responsible for keeping order, who is friendly enough to explain how things function. Umbra is open to almost everyone, regardless of what they might have done outside, as long as they behave and don't cause too much trouble. There are a few personal access points through which you could get in various slums, but otherwise there's no public information on where it is located, or who is in charge. There's also no hard rules, aside from no open aggression, but given the kind of individuals coming here, you shouldn't expect not to be attacked. \n\nHe explains that you can send your slaves here for work with no real restraint, as slaves are seen as mere tools to be exploited for profit. They will be quickly disciplined and put into their place if they dare to rebel.\n\nLastly, you get information on most relevant points of interest: the black market, and the slave auction. Both populated in general by opportunists sometimes allowing you to find things you will rarely see anywhere else."
    },
    "mapleQuestTexts": {
        "MapleFlirt": "[color=yellow]— I'm sorry, $name, but your proposal is against guild's rules. We are not permitted to get involved with customers. We are required to be professional at all times, and our employee policy is very strict... [/color]\n\nMaple pauses for a moment  breaking her usual down to business attitude and looks away thinking about something. She then continues with a slight change in  tone.\n\n[color=yellow]— On the other hand, you have been a great customer recently. If you are fine with a slightly unpleasant room, I'd love to thank you in person. [/color]\n\nAfter getting a silent agreement from you, she hastily leads you to an empty pantry. After looking down the hallway, she cautiously locks the door behind her.\n\n[color=yellow]— Alright, I shouldn't be needed there for another half hour or so. I'm sorry for this kind of a mess, but we are really not allowed to get intimate with customers... but I do want to please you.[/color]\n\nThe Fairy's tone became even more distinct from her usual attitude and makes you believe she is clearly doing this out of her personal admiration. She quickly jumps to your side, and after getting your permission to start, quickly kneels down before you facing your crotch. The lack of furnishing in the room gives you no choice but to stay standing leaning up against the wall, but it seems Maple has no problem with the uncomfortable position. \n\nAfter slowly revealing your already hard cock, the fairy's face turns bright red as she smiles. Her tiny hands gently wrap around your cock. With care and a hint of worship, she runs her hands up and down, bringing her mouth closer to the shaft. Slowly licking your cock, she makes sure her small mouth will be able to fit it. After giving you another passionate look, she somehow manages to fit your cock inside. Despite her actions being pretty awkward, her eagerness and tightness greatly make up for it. Feeling better and better with every minute, you help Maple to keep a steady pace by holding her head. After warning her about your approaching orgasm, she tells you to cum inside. As your semen gushes down the girl's throat, you notice how her eyes widen, but she does not choke, returning only satisfied moans. After carefully cleaning your cock of the last bits of semen, Maple finally manages to free her mouth.\n\n[color=yellow]— It would be hard to explain if my uniform got dirty. I hope you liked it. You should go first then. Come visit me later![/color]\n\nAfter a farewell kiss, Maple lets you leave the pantry. A few minutes later she reappears at the reception looking happy as ever. ",
        "MapleFlirt2": "[color=yellow]— I'm sorry, $name, but this is against... [/color]\n\nAfter looking around ensuring all is clear, the fairy whispers you to meet her in the same place as last time in 10 minutes. \n\nHaving barely closed the pantry's door behind you, Maple quickly jumps at you with a passionate kiss. Her serving attitude now also mixes with the clear attraction of a lover. \n\n[color=yellow]— I hoped you wouldn't ask me again... But it's my duty to satisfy my favorite customer. [/color]\n\nSpewing this excuse she once again seals your lips, letting you feel up her light body. Freeing her tiny tits from her clothing, you make the fairy girl release a couple of cute squeals. \n\n[color=yellow]— We shouldn't take too long, $name. Here, just use me as you want.[/color]\n\nMaple floats  into the air, positioning herself against the wall, presenting you her round bum. You tug at her shorts, pulling them down and revealing the clean white skin of her ass. As you free and push your member against Maple's crotch, she lets out a nervous pant, but gives you a sign to continue. To your own surprise, you have little problem penetrating the tiny girl's wet pussy, as it shows great elasticity. The fairy's blissful moan is quickly followed by her insides tightening around you. Without further delay you begin to move your cock in and out of her raw pussy, pressing her to the wall with each thrust. Despite her size and the force you apply to her, Maple moans with ecstasy getting closer to orgasm. You raise your speed at just the right moment, as she yelps and tightens over your cock. You have no option but to follow up, filling her climaxing body with hot seed.\n\nWith the naked fairy catching her breath on top of you, you suggest to Maple you would like it if she would consider joining you, but seeing her troubled expression, you do not expect a positive answer.\n\n[color=yellow]— As I've told you once before, I'm not for sale... But I'm not free to do anything either. I can't leave this place until I have fulfilled my contract. Sorry, I wish we could at least spend more time like this, but I really might get in trouble next time. [/color]\n\nAfter saying goodbye, you part ways and act in public as if nothing had happened. ",
        "MapleAudience": "After requesting an audience with the Host of the Slaver guild, you are lead through a pair of doors on the side of the receiving room and into an opulent office. You briefly introduce yourself. The Host responds in a fairly friendly manner, given your status, be it your standing with the Mage Guild or the amount of money you’ve made him. Getting straight to the point he inquires about your business in requesting this meeting. Upon hearing you wish to purchase Maple's contract, he seems a bit taken aback and gives you a surprised look. Composing himself, he explains that her whole upbringing and education has been on credit and now she's obliged to work off that debt in service to the guild. He pulls a file from his cabinet and lets you examine the contract. You realise that the contract was made before she was even old enough to make a reasonable informed decision. While the contract conditions may seem harsh, they most likely saved her from a life on the streets and no education to build a future upon.\n\nThe total sum left to pay is nearly 4800 gold, and judging by Maple's income, it would take more than a decade for her to pay off the rest of it. She's not technically a slave, but she might as well be. Seeing your gloomed expression, the Host tells you that since she's a diligent worker, and a popular guide, her leaving would be a big loss for guild plus he would have to train a new guide... However, a large bag of gold at hand would be rather useful and allow for expansion. Given your patronage and hopefully further support as well as being a respected person, he offers to sell you the contract for 7000 gold.",
        "MapleAudienceRepeat": "You can purchase Maple's contract for 7000 gold.",
        "MapleAudiencePurchase": "After sealing the deal, you receive Maple's contract.",
        "MapleTake": "You show to Maple your freshly purchased contract, to which she reacts with shock and joy.\n\n[color=yellow]— Oh gosh, I'd never imagine someone would do this much for me! I'm so indebted to you now. [/color]\n\nYou let Maple leave and she joins your household."
    },
    "plotSceneTexts": {
        "garthorscene1": "Garthor, after checking to see that he was not followed, enters one of the small houses. A tall, hooded man inside greets him and begins speaking:\n\n[color=aqua]— Now that the dark elf tribe has lost their leader, you should have no problem taking control. Considering this, I expect a favorable outcome from you.[/color]\n\n[color=yellow]— Indeed, for us, that was a lucky outcome. My clan's troops will soon push them out and their riches will then benefit us. Some members of The Palace are already opening up to me.[/color]\n\n[color=aqua]— Don't be too reckless. The other clans will act swiftly if they  ascertain your goals. If open confrontation occurs, we will not be able to assist you and death will find you swiftly.[/color]",
        "garthorscene2": "The orc pauses for a moment, then frowns in response to the man's words. Deciding the orc has received proper instruction and motivation, the hooded man changes topic.\n\n[color=aqua]— Regardless, things are going well. As a bonus, you will receive ten more slaves in addition to the previously established amount. Just make sure they remain away from the public eye to avoid any unnecessary questions. After all, you do have a good reputation to upkeep.[/color]\n\nThe man stealthily grins at the irony and observes how Garthor's mood improves.\n\n[color=yellow]— That's a very acceptable gift! We have a new plantation and mine which are still not fully operational. So, those orcs will be of great use.[/color]",
        "garthorscene3": "As the conversation finishes, the hooded man moves to the roof where he surveys the colorful, crowded streets below.\n\n[color=aqua]— Useful tools indeed..[/color]",
        "hadepast1": "1x years ago…\n\n[color=aqua]— as my research has proven, enslaved individuals from non-human races perform distinctively better and are much more subservient.[/color]\n\nAs the auditorium grew restless, the presenting magister calmly dismissed Hade before summoning the next speaker. As Hade returned to his seat, the other students gathered around him. One of his friends addressed him with a smile.\n\n[color=green]— How can you be so bold? Half of the audience are non-humans, yet you present such things?![/color]\n\n[color=aqua]— I merely produced my findings. If they can't accept scientific observations, that’s their fault.[/color]",
        "hadepast2": "[color=yellow]— That is ridiculous! Are you suggesting we expel anyone who is not human from The Order as well?! — A halfkin girl approached Hade with clear exhibition of disgust on her face, — You must be out of your mind?! You should be expelled for displaying such fictitious bias.[/color]\n\n[color=aqua]— Science doesn't see prejudice. I merely showed clear evidence of a more efficient way to utilize the slave labor trade, to solve our labor shortage, with little risk to our society as a whole. If you disagree with my work then research it on your own.[/color]\n\n[color=yellow]— Brilliant, let's just repeat what caused The Old War. It’s a relief that The Main Order won't consider your bullshit. You'd make a great Almar.[/color]\n\nHade made an effort to conceal his rising anger, and quickly returned the insult.\n\n[color=aqua]— Louise, you don't have to be so upset that you aren’t part of the human race. If only you could go back and tell your mother not to fuck animals.[/color]\n\nAfter seeing the appalled look on the halfkin girl's face, Hade satisfyingly grinned. Quickly after he left the room. He had no other interests in the other speakers. The Order might not acknowledge the benefits of his ideas, but he knew he was on the right track. To him, his ideas always rewarded the effort…",
        "hadepast3": "Hade stood over, what once was, his life’s work. His research now nothing but a pile of ash. While he was away, at dinner, someone broke into his dorm. Even though his room looked like a hurricane went through, his research was the culprit’s only target. He knew exactly who to blame and he soon found a group of students, led by Louise.\n\n[color=aqua]— You bitch, I know it was you! You will pay for this.[/color]\n\nThey played the innocent card as they poorly masked their joy.\n\n[color=yellow]—What are you  talking about?! Someone destroyed your vulgar research?! I should thank them for it, should I ever find them.[/color]\n\n[color=aqua]— Just wait till I report this to the headmaster, foul halfbreeds![/color]\n\nEngulfed in a rage, Hade leaves the group as he rushes to the headmaster.",
        "hadepast4": "Despite his best effort, The Order turned a blind eye.\n\n[color=green]— Leave it Hade. Even if your research wasn't destroyed, it would have never gained ground. The truth is, The Order has an unconditional policy to never get involved in racial controversy. Your work would just be ignored by the Council and all you would receive is more hate from others. Find another use for your passions.[/color]\n\nThe headmaster's words struck Hade, but it made no impact on his thoughts. After a couple of moments, he finally replied.\n\n[color=aqua]— I see now…[/color]\n\nAs he left the headmaster, no other member of the school would see him enter or leave his room. Unable to forgive the other students and the authorities, he disappeared the next morning.",
        "slaverguild": "A meeting of several slaver guilds across The Empire's central region has began shortly. The huge conference room had about a dozen of highest members in it.\n\n[color=yellow]— Gentlemen, I think it's about time we address the growing conflict with The Order that has been developing over the last decade. With the recent slavery law changes, it's obvious The Order is aiming to crush our trade.[/color]\n\nThe room fills with anxious gibbering.\n\n[color=aqua]— We should've foreseen and acted on this long ago. I had personally suggested we started switching wheels three years ago, but most of you are too absorbed into your gold to think about anything but drool over your gold piles. — a younger member brazenly spoke up[/color]\n\n[color=green]— Shut it! Why would we willingly abandon what made us so powerful in first place? No other business is on the same level of profitability and you know it.[/color]",
        "slaverguild2": "After a couple more minutes, one of the quieter members stood up, requesting attention.\n\n[color=aqua]— Gentlemen, I'm about to propose a solution. Recently, I've discovered a small group of people, led by a certain ex member of The Order. It is he who seems quite willing to oppose the current hierarchy in The Order. I've listened to his ideas and they seem to parallel ours…[/color]\n\n[color=yellow]— Are you suggesting we topple The Order? That's absurdly reckless. Could you imagine the repercussions should we fail?[/color]\n\n[color=aqua]— Indeed, I have. My contact also sees the risk. However, why destroy The Order, if we can instead replace the leadership? Regardless, his activity could slow down any political reforms they have in the works. If we sponsor my contact’s organization, we could redirect his goals. With our money, power, and the many relatives already in the vicinity of the Main Order, it wouldn't be hard to perform a coup.[/color]\n\nUpon hearing these words the room fell silent. Many members began to carefully think it over…",
        "hadefrostford": "An agent  walked into the room with the report on the latest events from Frostford.\n\n[color=yellow]— Theron has been removed from his position![/color]\n\nHade slowly inspected the documents before replying.\n\n[color=aqua]— This is great news indeed! With his removal, Frostford will draw the gaze of the council. With a few more touches, we can proceed.[/color]\n\nAs the pieces fell into place, Hade smiled to himself.",
        "hadefrostford2": "An agent walked into a room to deliver the report on the latest events from Frostford.\n\n[color=yellow]— The diversion group has been defeated…[/color]\n\nHade slowly inspected the documents before replying.\n\n[color=aqua]— Those militants couldn’t even complete their mission?! Defeated by $name?! Intriguing, $he shows growing potential. Although, this will also make Frostford stronger. Oh well, it doesn’t really matter, we will carry out our plan soon.[/color]",
        "hadefrostford3": "An agent walked into the room to with the latest report on the recent events from Frostford.\n\n[color=yellow]— The Frostford's spirit has been routed…[/color]\n\nHade slowly inspected the documents before replying.\n\n[color=aqua]— Glorious! Fought by $name? Interesting, $he shows quite a growing potential. Although, this will also make Frostford stronger, it matters not. We will carry out our plan soon.[/color]",
        "hademelissaend": "In the middle of the night desert, two figures shared a campfire with no other soul for miles around. Hade seems completely unfocused and disinterested in his meal. Melissa observes her brother closely, recalling the day he made contact with her. She had no idea she had a living relative, especially a sibling. He supported her promotion from mere slave to the Order's secretary. This gave her a reason to continue. Now, all that is in the past.\n\n[color=aqua]— You should've left me for dead! My failures deserve no place in this world![/color]\n\nThese were the first words he spoke after they vacated the capital. Melissa said nothing in response. She knew that Hade would be depressed and was prepared for such behavior. They are outcasts now. However, she had made preparations beforehand, in case of such a failure. It was a small, rural house far from The Order's eyes. She didn't expect Hade would recover and revert to his prior state. Regardless, she did not regret her decisions. A quiet life would be suitable enough.",
        "undercitybookenc": "As you carefully make your way through the damp and rubble clogged tunnels, a small glint catches your attention. Upon closer inspection, you discover an old wood and metal door set into the stone. Despite its age and apparent wear, the door holds up pretty well in its frame. However, after a few moments of testing it, you find a weakness in the wood and push on into the space beyond. \n\nYou stand in the ruins of what appears to be a private residence. Debris blocks most of the foyer, through which a small gap between walls reveals a navigable hallway. The narrow, high ceilinged corridor leads further into the ancient residence, revealing blocked passages that were once elegant rooms.\n\nAt the end of the corridor you discover what was once a grand library, shelves towering into the two-storied room. Though no doubt once filled with precious tomes of knowledge, now the shelves are lined with rotting leather and the heavy stench of mildew. As you scrape your boot against piles on the floor, looking in vain for something of interest, your actions disturb something in the library. ",
        "undercitybookafterabttle": "As the beast lies dead before you, something near its body catches your eye. Warily, you pick up a thick leather book. Aside from some light scuffs and dirt, the tome appears to be perfectly fine. Magic must have kept it from suffering the same fate as the rest of the library. ",
        "zoebookdiscover": "As you relax in your apartments, there is a soft knock at your door. \n\n[color=yellow]—Hey, $name. Do you have a minute? [/color]\n\nZoe stands at your door, her eyes bright and ears perked in interest. You greet her and ask what’s going on. \n\n[color=yellow]—I found a book in your stash with some symbols that date back to the Great War. I'm not positive, but the symbols in it look familiar… Given enough time I can try to translate it. Back at home I’ve had a book describing similar patterns. If i’m not mistaken, it was a book describing how there are other dimensions, different from ours and if that’s true, we might be able to connect to it somehow.[/color]\n\nThe way the young wolf girl is speaking, it’s clear she’s confident in her knowledge and very interested in your discovery. You yourself haven’t had time to look it over in great detail, but it's clearly in a fairly old script and very likely an advanced piece of magical text. \n\n[color=yellow]—If you'd let me, I can translate the book for you. It might hold all sorts of answers about the ancient past![/color]\n\nYou doubt there’s much harm in letting her see it, and it’s possible she can research the text for you as she says. However, you’re a little unsure of lending the book to the studious girl. ",
        "zoebookallow": "[color=yellow]—Great, thank you, I'll get right to it![/color]\n\nZoe’s fluffy tail wags, showing the girl’s happiness. She takes the book from you, holding it close to her chest as she hastily bids you good night. As you watch her go, you can’t help wondering if you’ll ever get that book back. ",
        "zoebookrefuse": "You decide it could be dangerous to let her mess around with the book, considering its unknown qualities. Zoe’s face falls, her ears drooping at your reply.\n\n[color=yellow]—Oh.... yes, you’re right. I’m sorry to have bothered you about it. [/color]\n\nThe wolf girl bids you goodnight. ",
        "zoebooktimepass": "You recall it’s been some time since you lent that magical book to Zoe. More worryingly, you can’t recall seeing her around the manor since then. Thinking it’s time to check on her, you’re surprised when Zoe finds you instead. \n\n[color=yellow]—Hey, $name, I’ve been studying that book and I think I’ve come across something that could be really useful to you. [/color]\n\nZoe opens the book and shows you a section with several faded diagrams. \n\n[color=yellow]—Most of the book seems to be about summoning monsters and destructive magic that's formed from other realities, but this section talks about a way to harmlessly subdue enemies. [/color]\n\nYou skim through the pages Zoe indicates, however the symbols mean nothing to you and you must rely on the neatly written notes of the girl's translations. A diagram on the last page is more familiar, and seems to be a fairly standard circle of power.\n\n[color=yellow]—I’m sure I can set things up for you to be able to use this, $name. Only... It does require a few things. [/color]\n\nYou sigh but guess it’s to be expected. You ask Zoe just what it is she needs. \n\n[color=yellow]—Well, the spell’s most difficult component has to do with teleportation magic. I've written a list of things I'll need in order to try it out. Just let me know when you have these things.[/color]",
        "zoebookdeliveritems": "[color=yellow]—Oh, wonderful! Thank you, $name. I’ll be working on it and let you know once there’s some results.[/color]",
        "zoebookdelivercontinue": "You almost forget about leaving Zoe, when suddenly, you hear a feminine cry for help coming from the library. Bursting through the door, you are greeted by the sight of Zoe in a magic circle, clutching the open book in terror as long, slimy pink tentacles hold her fast. Scraps of her clothing lie strewn about the floor.\n\n[color=yellow]—$name, beware...![/color]\n\nThe tentacles coil about her legs and arms, holding her tightly and removing the magical tome from her grasp. In a moment, the naked wolf girl is being lifted in the air helplessly trying to escape the monster's grip.\n\n[color=yellow]—No, Stop it!![/color]\n\nZoe struggles as another tentacle tip snakes between her closed thighs and slides against her slit.",
        "zoebooksave": "In the blink of an eye, you sprint forward into the room towards the magic circle. With a quick kick, the nearest ritual stone ringing the magic circle is sent flying away. The tentacles begin to tremble and weaken. You pull a terrified Zoe out of the circle just in time for the tentacles to pool into the center. The air grows frigid as a demonic howl fills the manor and the tentacles sink into the magic circle with a flash of light.\n\nBlinking, you see the tentacles and circle gone. You look down at Zoe, who is gripping you tightly. Giving her a gentle shake, she blinks and looks around. Her eyes are still wide in shock at the narrow escape. You ask her if she's alright.\n\n[color=yellow]—Yes, I’m fine. I’m so sorry things went wrong, but thank you for saving me, $name. [/color]\n\nDespite the harrowing adventure, Zoe’s relieved smile radiates toward you. After calming down, she passes you the details of the spell she managed to pull off. In the end she refused to touch that book ever again.",
        "zoebookwatch": "Cautious, you decide to stay back and look for a better opportunity. The tentacles continue securing Zoe's body, making her exhaust herself with struggle. As her flailings grow weaker, the monster pulls her legs apart to expose her delicate snatch. Gasps of horror escaping from her mouth allow it to be filled with another tentacle, muffling her protests. \n\nIn the same time Zoe's pussy and breasts are firmly stimulated by other tentacles, seemingly in an attempt to either inspect or arouse her. This seems to have some effect as two tentacles part the girl's lower lips, revealing her dripping entrance. As a third tentacle lines up with her hole, Zoe realizes what's about to happen and attempts to struggle and protest again with the thick tentacle in her mouth.",
        "zoebookwatch2nonvirgin": "The third fat tentacle between her legs steadily pushes in, stretching her hole as inch after slimy inch disappears into her. As it reaches some depth, it withdraws before pushing back in. Following this pattern, the tentacle in her mouth accompanies it, raping the poor girl in unison.\n\nThe wolf girl continues to make pleading sounds for help, which have a hint of moans in them, as the two tentacles continuously use her at both ends. The tentacle from Zoe's pussy pulls out, soaked in the girl's juices. ",
        "zoebookwatch2virgin": "The third fat tentacle pushes into her virgin pussy, ripping through her hymen, causing muffled moans of pain and tears from Zoe.) As it reaches some depth, it withdraws before pushing back in. Following this pattern, the tentacle in her mouth accompanies it, raping the poor girl in unison.\n\nThe wolf girl continues to make pleading sounds for help, which have a hint of moans in them, as the two tentacles continuously use her at both ends. The tentacle from Zoe's pussy pulls out, soaked in the mix of girl's juices and blood. ",
        "zoebookwatch3": "Before Zoe can realize it, it makes its way into her butthole, pushing it apart with some effort. At this point she only has the power to softly whimper as her body is forcefully used. Her compliance is short lived as a new tentacle, thicker than others, rises up before the girl's recently vacated pussy. After a brief grind, as if teasing her, it abruptly thrusts into her cunt.\n\nZoe arches her back, crying out in protest as all three tentacles begin to fuck her with unconditional vigor. Smaller tentacles stroke and caress her clit and nipples, over stimulating their victim. Soon her cries of protest change to need. The tentacles move even faster, as if sensing her approaching climax. Despite the tentacle in her mouth, Zoe's climactic moans are crystal clear as she reaches her peak. The tentacles shudder, the smaller ones spurting a clear, sticky fluid over Zoe's body.\n\nZoe coughs and swallows as the same fluid begins to spew into her mouth. The tentacles within her other holes energetically pump her full of the tentacle's sexual release, the mixed fluids from the wolf girl and the tentacles spilling onto the floor.\n\nTaking this moment as a good time for interruption, you burst in and knock down one of the ritual stones, breaking the circle. As you help Zoe to clean and recover, you feel relieved there's no physical harm done to her. \n\n[color=yellow]—$name... Thanks... [/color]\n\nThough clearly exhausted and shamed, Zoe does not seem to openly blame you for this event. After she finally regain her composure, she passes you the information on her studies, making it clear she will never touch this book again. ",
        "zoeitemlist": "[color=aqua]You need to bring: 10 Teleport Seals, 5 Magic Essences, 5 Tainted Essences.[/color]"
    }
}