{
    "storyQuestTexts": {
        "MainQuestGornStart": "[color=yellow]— Oh, come on in, $name. It is a pleasure to see you’re still regularly visiting us. I assume you are ready for a new task. This time we have an actual issue on our hands. As you know, the Order takes care of all sorts of political disputes around for the benefit of the kingdom. How do you feel about travelling to one of the hotter regions? We received a request for help from the Orc's capital, Gorn. \n\n— Apparently, there's some local disputes we have been asked to solve by one of the councils in government. Surely, you should be able to take care of that. Just one suggestion, try to keep a low profile and not disclose who you are while working on it. Not everyone is happy to have the Order directly involved in what they consider their own business. When you get there, look for an orc named Garthor from the Sorgul clan. Help him out with this, then come see me. Later. [/color]",
        "MainQuestGornPalace": "You make your way to the biggest and cleanest building in the city, The Palace, quietly passing the guards by presenting your badge. Shortly thereafter, you manage to locate Garthor. Despite his mildly savage look, his composure carries an indication of  maturity and seriousness. He invites you into a relatively small room where you can talk in private. \n\n[color=yellow]— Greetings, $name. Melissa told me, that you will be helping out with our small problem. [/color]\n\nThe Orc gives you a brief summary regarding a large dark elf clan called Kel'tor located to the east, and while nominally neutral to Gorn, has recently been taken control of by an ambitious young elf with unclear motives named Ivran. His informant however suggests, that Ivran is potentially very dangerous and the recent course of Kel'tor seems to indicate more aggression towards the surrounding areas. In either case Garthor wants you to capture him and bring him in for interrogation. After that a decision will have to be made on what to do with him. Infiltration of their lands won't likely bear any fruit as they are extremely suspect of strangers. \n\nYou are given a full estimated schedule of Ivran and it's clear that capturing him around evening on the hunting fields, which he regularly visits, might be the only option to catch him with the fewest guards possible. ",
        "MainQuestGornIvranFind": "After some time scouting you manage to spot Ivran resting in a camp, surrounded by his men after the hunt. The dark skinned elven male has a very slender, almost feminine figure and somewhat delicate face, making you wonder how valuable he might be in other circumstances. Their hunting seems to have taken them further from their settlements, so there shouldn't be any reinforcements if you strike now. ",
        "MainQuestGornIvranWin": "Despite Ivran’s men trying their best to protect him from your assault, you take him captive. With some of them retreating and likely calling for help as the fight started, you decide a quick withdrawal is in order.You blindfold and tie the elf then make your way back to Garthor. \n\nThankfully, city guards let you in without question and the appointed person leads you to Garthor. He seems quite pleased with your work and tells you to return in a few days, once they have managed to get some information out of your captive. ",
        "MainQuestGornPalaceReturn": "You make your way back to Garthor, who apparently has been waiting for your arrival. After a brief greeting, he tells you that Ivran was planning to begin actively moving against Gorn's government and was in position to attack the city. Obviously, his existence endangers too many people, so we can't let him leave now. However what to do about him is left for you to decide. ",
        "MainQuestGornIvranExecute": "Garthor gives you a nod and says that Ivran will be quietly disposed of. He passes you a letter and explains that this is a message for your boss indicating that you have completed your job. He expresses his gratitude and hopes to work with you again some future day.",
        "MainQuestGornIvranImprison": "Garthor gives a slight frown, but agrees and tells you that Ivran will be kept in his personal cell. He passes you a letter and explains that this is a message for your boss. He expresses his gratitude and hopes to work with you again some future day.",
        "MainQuestGornAydaSolo": "\n\nAs you are about to leave, Garthor stops you and passes you a small note. He explains, that there's an independant alchemist in the city which you might be interested in, and that he wants to thank you at least minorly by introducing you. ",
        "MainQuestGornIvranKeep": "Garthor says that it is too dangerous to keep Ivran free and alive. Even if you brainwash him, he might recover his memories and try to rejoin his clan, creating even more problems in the long run. However, after some thought, he writes you a letter and asks you to pass it along to a specific alchemist and researcher, who is a friend of his and might be able to come up with something if you insist on taking possession of Ivran. After giving you her location, he tells you that he will be waiting for your decision. ",
        "MainQuestGornIvranChange": "You return to the Palace with the newly acquired solution and explain the details to Garthor. With a minor grumble he accepts as long as the elf will not remember anything ever again. Thankfully they will provide the necessary support for free, so without further delay you pass the potion to Garthor.\n\nAfter about an hour they bring you a cuffed dark elf girl, who has already undergone all the changes. She is still quite lean and undeniably attractive. Without knowing who she was, it would be very hard to draw the connection between the two. Lastly, Garthor passes you a letter to be given to your boss and sends you on your way. After returning to your mansion, you decide it's a good time to give her a new name:",
        "MainQuestGornAydaIvran": "You enter a heavily cluttered building with few windows. Tables and shelves are tightly packed with various bottles and alchemical ingredients, a few of which you can easily recognize. Your entrance is announced by the small bell above the door, responded to by a muffled greeting from far behind the work room. After a moment, a young beastkin bunny boy who appears to the the alchemist’s helper rushes up to you. You pass him the letter you received from Garthor and he quickly disappears into the back rooms. \n\nAfter a few moments the master of the place comes out. She is a dark elf woman with a stern yet bored look. Finally she speaks up after measuring your appearance. \n\n[color=yellow]— Hello, $name, You can call me Ayda. So you are the one who took care of that issue. The letter told me you are looking into ways to take care of Ivran and want me to provide assistance with making him... harmless. I guess, I can provide you with one... unconventional method. You could turn him into a woman, I heard he's already somewhat of effeminate looks, so you will get yourself a new plaything. This is not your average body modification however, and the effects won't be reversible. Dark elven clans are strict and patriarchal, so even if he was able to prove that he's their old leader, it's nearly guaranteed they won't follow after him. That should be sufficient for your plans?\n\n— I will want you to help me out first though. I gather you have enough connections and power to provide me with a part-time worker? If you bring me someone with sufficient potential skill in magic control and let me keep her or him for 2 weeks, the potion is yours. While you do that I’ll also gather what I need.[/color] ",
        "MainQuestGornAydaFirstMeet": "You enter a heavily cluttered building with few windows. Tables and shelves are tightly packed with various bottles and alchemical ingredients, a few of which you can easily recognize. Your entrance is announced by the small bell above the door, responded to by a muffled greeting from far behind the work room. After a moment, a young beastkin bunny boy who appears to the the alchemist’s helper rushes up to you. You pass him the letter you received from Garthor and he quickly disappears into the back rooms. \n\nAfter a few moments the master of the place comes out. She is  a dark elf woman with a stern yet bored look. Finally she speaks up after measuring your appearance. \n\n[color=yellow]— Hello, $name, You can call me Ayda. I'm holding this little shop, and occasionally dealing with city's problems. It seems that we might be able to help each other in the future. Let me know if you have something on your mind. [/color]",
        "MainQuestGornAydaIvranAccept": "[color=yellow]— Alright then, see you later.[/color]",
        "MainQuestGornAydaIvranReturn": "Ayda passes you the small flask filled with a bright, shining liquid and proceeds with an explanation. \n\n[color=yellow]— This is my personal mixture. Make him drink everything. Be careful though, as I won't give out more samples nor distribute it freely. Don't disclose the details on where you got it either. Since there's no mage order establishment in Gorn, I can quietly work on my research with only a small shop, as long as I do enough for the Palace. Well, feel free to drop by, as long as you don't ask me for charity. [/color]",
        "MainQuestGornAydaIvranReject": "[color=yellow]— Alright, this was a one time offer. Now he's only yours. Feel free to visit again, as long as you don't ask me for charity. [/color]",
        "MainQuestGornMelissaReturn": "You give Melissa the message you brought from Gorn. After reading she replies with joy.\n\n[color=yellow]— Already done? Nice work there. Here, take your reward, you earned it. I wish I could also reward you with some time off, but a fairly urgent matter has arisen. With your recent accomplishments and dedication I would rather entrust it to you, than another.\n\n— Are you familiar with Amberguard? It's an old elven town located to the East of Wimborn. Unlike many of the wandering elves you might have seen about, those who live there prefer to have as little to do with us as possible. However, they do still obey and follow the rules of the Order so you should not encounter any problems travelling there. They probably won't act very friendly, but I believe you will manage.\n\n— A short distance North of Amberguard, you will find one of the entrances to an old underground tunnel system. The entrance was sealed away by the elves hundreds of years ago. An informant of mine reports that the entrance appears to have been sealed in haste, and it is very likely that there may be ancient relics as well as documents containing important and valuable knowledge left behind in those tunnels.\n\n— As you might have guessed, outwardly your mission seems pretty straight forward when put into words, heh. Find a way into those tunnels, find out what’s in them and bring back whatever you find. \n\n— It’s going to be harder than that though. Those tunnels were sealed for a reason, what that is I don’t know but I expect it could be rather dangerous, so I would take as many combat capable escorts as I could if I were you. \n\n— See you later, oh and $name, keep this mission and whatever you find on the down-low for now.[/color] ",
        "MainQuestGornMelissaAfter": "On your way out of the building, you hear your name. As you turn around, a sharply dressed man approaches you. He introduces himself as David.\n\n[color=yellow]— I’m a member of Internal Affairs with the Mage Order. We are based in the Capital and are responsible for dealing with all problematic matters that arise involving members of the Order, as well as those that might affect them. I’d like to ask you a few questions please.[/color]\n\nHe inquires if you have any knowledge of or heard any rumors regarding an individual named Hade. Quickly picking up on your confused look  he gives you a brief summary of the subject. In recent months there have been a number of rumors regarding  an individual calling himself Hade, who has been interfering in guild business and we believe attempting to recruiting members of the Order. Outside of a few unexplained deaths and disappearances suspected to be linked to him, there is almost nothing to go on. Moreover, the Senate does not believe that anyone would be able to, or have the audacity to willingly disrupt or even oppose the entire Order, so they discard those reports as meaningless rumors as there simply is not sufficient evidence to prove anything.\n\nWith that, he expresses his respect for your hard work and dedication, as well as congratulating you on your recent achievements and quick promotions. He asks you to contact him should you come across any information or encounter something suspicious that may be related to Hade. After leaving you with his coordinates and a reminder that Hade is potentially a rather dangerous individual, David disappears into the ancillary portal room.",
        "MainQuestAmberguardSearch": "After spending a few hours reading through reports and documents in the town's archives you only succeed in ruining your own mood: even though locals allow you access to almost everywhere, they go out of their way to be as unhelpful as possible. Nearly giving up and needing a break  you stroll around the town, trying to clear your head. A call out from a side alley brings you to a sudden halt. A lean looking man stands in the shadows.\n\nBeckoning for you to come over he makes you an offer. He might know someone who knows how to enter the tunnels but it’s going to cost you for the information.\n\n[color=yellow]— You look like the type of person who can afford it. 1000 gold and the information is all yours. You’re not going to get help from any of the other locals, that’s for sure.[/color]",
        "MainQuestAmberguardReturn": "After a quick search of the backstreets you find the lean man who offered to assist you before. He requests 1000 gold for the information he has.",
        "MainQuestAmberguardPay": "After double checking your payment, the stranger tells you of a hermit witch that lives outside of Amberguard. The local villagers occasionally visit her for supernatural help, and if anyone around here knows anything about what’s behind that seal it would be her. After giving you clear directions on how to find her, he hastily retreats down the alleyway securing the pouch of money beneath his clothing.",
        "MainQuestAmberguardWitch": "Following the directions given, you reach a lone wooden cabin nestled in a clearing. After confirming you’re where you think you should be and unsure of what to expect, you slowly make your approach. Before reaching the door it swings open unexpectedly and a Drow woman exits the house.\n\n[color=yellow]— What an unusual guest we have here. You’re welcome to visit, as long as you were not planning to sneak in that is.[/color]\n\nShe looks over at you quizzically. \n\n[color=yellow]— Come on in and tell me what brought you all the way out here, mage. [/color]",
        "MainQuestAmberguardTunnelsAsk": "[color=yellow]— Hmmm... a dangerous place. From what I have learnt, within the tunnels used to be a human city, which was destroyed during the events of the Great War, and now all that is left are ruins. Maybe some magic experiment went out of control, maybe destructive elven magic. Not gonna make blind assumptions, but I'd imagine tens of thousands died and were left there. On top of that, leftover magic has polluted much of the area.. \n\n— I believe at some point, it became so bad they decided to seal the whole thing underground. It was most likely too late though and some of the pollution affected the surrounding areas. You should be familiar with what sort of things happen around magic pollution. I've tried to find more info about it, but the Order seems to have patiently cleaned up everything after the war ended and access to a lot of information is restricted. Not surprising given your usual pedantry on the subject. [/color]",
        "MainQuestAmberguardTunnelEnterAsk": "[color=yellow]— So you want to explore those ruins? Yes, I know how to get in. Locals avoid going near the place, buncha scaredy cats if you ask me.  I would however ask you for a favor in return. \n\n— Since you seem to be a rather skilled mage it shouldn’t be too difficult for you to get me a couple slaves? I'm mostly interested in using them for my experiments. Mostly... I want you to bring me one elf and one drow. I am studying the differences between them and it's hard to find willing folks for my experiments. That, and drow are simply not common in these parts. \n\n— Bring me both and I'll get you underground. [/color]",
        "MainQuestAmberguardSlaveDeliver": "[color=yellow]— Alright, I'll take those. Now I'll tell you how to get in. \n\n— Yeah, there's no point trying to unseal the main entrance, since that would require a lot of effort and there are simpler ways to get in. Many creatures have tunneled holes to get in and out, not to mention there are a number of caves that have openings. I'll tell you how to get there, but be prepared, I don't think there is much in there that wouldn't try to cut or bite your face off. [/color]",
        "MainQuestUndercityReturn": "Melissa’s excited greeting upon your return seems even more anticipatory than usual.  As you relay your findings she eagerly listens to every word.\n\n[color=yellow]— An ancient golem, didn’t think there were any left? I’m impressed you were able to deal with it. The Order used to produce golems in the past. From what I understand, they proved to be far too costly and the process too complicated to use for mass production. The parts required to produce them, along with the skill to craft materials sufficiently susceptible to magic manipulation were beyond the ability of all but a few Arcanesmiths. And that’s just to create the body itself, and does not even take into account creation of a level of sapience so they could be automated. \n\n— After the War was over, the need for golems was reduced and the skill to craft them was mostly forgotten. It was simpler, cheaper and quicker to train people on as regular guards. There was little need for highly specialised and powerful guards. \n\n— Anyway, give me a week or so to look through these papers and see what mysteries they hold. And thank you again, you’ve far exceeded my expectations in this regard.[/color]",
        "MainQuestFrostfordMelissa": "You walk into Melissa's office and find her focused on some papers spread about her desk. As you make an appearance, she rises up to greet you.\n\n[color=yellow]— Oh, hey $name. I was about to send someone to summon you but since you are already here it saves us some time. I've received a message from the Capital. The Main Order has requested you meet them regarding some business they are not willing to disclose in the letter. You'll have to deal with them before I can give you any new assignments, so don't waste too much time.[/color]\n\nAfter receiving the invitation paper and a teleport pass, you leave Melissa and make your way to the central hall. ",
        "MainQuestFrostfordMainOrder": "Stepping through the teleporter, you appear in the main headquarters of the Mage's Order. Although it is more grand than the Wimborn one you are familiar with, the atmosphere feels surprisingly similar: multiple people rushing around with various gadgets and documents. After talking to the guards, you are directed to one of the higher floors where it seems to be quieter with fewer goings on. You can almost feel the power and potential that you might achieve here. Finally locating the parlor you've been summoned to, you enter after a knock. \n\nThe spacious room with multiple seats and tables is quite unlike what you might've expected from the higher echelons of the Order. This room seems to be more like any of the others, albeit a slightly more extravagant looking clerk workplace, a common theme for the Mage's Order: efficiency and asceticism always takes priority. Multiple seats are taken by eccentric looking people, some of them not human. \n\nUpon your entrance about half of them switch their attention to you and silence descends on the room. After you give a brief introduction, a senile looking man's face brightens and he addresses one of his colleagues. \n\n[color=yellow]— Oh, right,$he is the one we want to deal with that one issue... Ellen, could you give a summary to our guest?[/color]\n\nAn elf woman with unusually aged eyes rises up, and after giving a slightly contempt look at the old man, addresses you. \n\n[color=aqua]— We of the council greet you, $name. Recently we have heard news of your achievements within your local branch and from your mentor. The Mage's Order has always respected resourceful people and from our information you have... [/color]\n\nHer speech is interrupted by a groan from the previous speaker, indicating that she should get to the business. \n\n[color=yellow]— It has come to our attention that one of our neighbouring regions is experiencing hardships of an unknown and potentially dangerous origin. Frostford has requested our help in dealing with some sort of new disease. Their government hopes to keep the incident under cover to prevent unnecessary panic and to try prevent the possibility of it spreading to new victims. We believe, that with your experience travelling and dealing with other races, not mention your skill in the magic arts, you are well suited to this task. \n\nHer introduction speech is cut short by the same old man, who seems to be the informal leader. \n\n[color=aqua]— This is not an opportunity you would get from your local guild, a chance to show your true potential around here, kid. Discreetly take care of Frostford's problem and you will prove your worth around here, easy, right?[/color]\n\nJudging from the little you could put together, the task at hand will be anything but easy. You can't help but admire the manner in which the old man manipulates those around him. \n\n[color=aqua]— Now, give $him the papers and we can get back to those…[/color]\n\nYou weren't able to make out the last of his words as one of the orderlies guides you out, handing you your instructions and permissions. Having no further business at the capital, you return to Wimborn. ",
        "MainQuestFrostfordCityhall": "Upon arriving at the Frostford City Hall, you are greeted by a large male Beastkin of wolf origins, who introduces himself as Theron, current leader of the ruling clan. He informs you that he has been waiting for you. \n\n[color=yellow]— I don't want to waste any time with niceties as my people are suffering at this moment, so I'll get straight to business. Recently some of our hunters have been plagued by some unknown disease while they were out on assignments. They seem to experience a fever along with extreme pain due to... well their skin rotting. From what we can tell, it does not seem to be contagious, at least nobody assisting them has shown any signs of being infected. You can see them, but I hope we can keep a low profile on this issue, as while it does not seem to be a threat to others, we would rather not cause worry or panic among the citizens. [/color]\n\nAfter taking notes from Theron on the issue, you make your way to the infirmary and are met by a horrendous smell. You look around, all the while covering your nose. After spending half an hour inspecting the patients and talking to the medics it seems that the plague does not appear to be natural at all. The only lead you have points at them all having visited the same area located to the southwest, before coming down with this illness. Perhaps you should investigate that area with care.",
        "MainQuestFrostfordForest": "You enter into a forested area, quickly noticing something seems to be a bit off. After looking around for a few minutes you realize that the plants and trees are growing in what appears to be carefully chosen spots, as if planted by someone rather than naturally spreading, however there does not seem to be any indication of a settlement for miles around. You also take note of an increased animal population around, having encountered more than usual. \n\nAs you progress deeper into the forest, you are stopped by an unfamiliar voice out of nowhere.\n\n[color=yellow]— That's enough stranger. These lands do not welcome just anyone, even if you do not pose a threat.[/color]\n\nWith that a female dryad steps out of the woods. She does not appear to be your usual dryad, but a powerful spirit governing this forest. You've heard old tales about spirits manifesting and growing very strong in places with no civilization, but finding one in this time and age would require one to venture into some very dangerous places far from civilization. One thing all those tales had in common, was that spirits are nothing like a normal person and can take on many aspects being harmful, beneficial or uncaring.\n\nYou explain the reason for your intrusion, but the spirit shows little reaction to it.\n\n[color=yellow]— Those hunters have been punished for intruding and harming those within my domain. They killed animals, they cut trees for their camps and fires. They should be happy I haven't killed them all, since they showed no mercy here. You can tell them this. If new marauders continue to show up their curse will never weaken and end. [/color]\n\nUpon your suggestion that they probably had no idea they were entering an area they were not welcome in and are used to hunting what they can catch, the spirit grows irritated. \n\n[color=yellow]— Enough. If they really wished to be cured, they should've come of their own accord and begged for mercy, not sent someone else to fix their mistakes. This talk is over.[/color]\n\nThe spirit disappears into the thicket, leaving you with nothing else to do but to return to Theron and tell him everything.",
        "MainQuestFrostfordCityhallReturn": "After telling Theron about your encounter in the woods, he seems to become even more irritated than the spirit you recently met.\n\n[color=yellow]— Why haven't you killed it?! I thought you were sent by the Order and are here to solve our problems! Just kill it, burn down the whole damn thing if need be, I'm sure the curse will be undone upon its death. You don't expect us to starve just because of some forest monster do you? [/color]\n\nHis extreme reaction, along with his demand makes you  think that there's something more going on than just the cursed hunters, so you decide to ask why they even disturb those grounds. After a long silence, Theron opens to you,  and finally explains his problem. \n\n[color=yellow]— Since you've already agreed to look into our problem, I must respect your need to have as much information as we can give and trust you won't cause us any harm. These lands were gifted to us a long time ago but they are not very suitable for living. The coldness and constant snow makes most attempts at agriculture impossible. We have always been limited in our food resources and only managed to avoid starvation because we import a constant supply of provisions, but we have to pay for it with hard labor, as nearby mountains hold rich resources in them which we can trade with. I don't even want to think what would happen if supplies stopped or if the Empire turned on us. We need new ways to sustain ourselves and that forest has what we need. We just can't pass up on a means to be more self sufficient.[/color]\n\nYou tell him, that you need to consider your options and leave the room.",
        "MainQuestFrostfordCityhallZoe": "After you leave the building, you hear someone calling you over. Turning around you see a richly clothed young wolfgirl seeking your attention. \n\n[color=yellow]— Wait up! I'm sorry but I've been eavesdropping on your conversation with my uncle. Please, listen to me, there's been a huge mistake... [/color]\n\nYou decide to listen to the girl's plea as she might have some useful information.\n\n[color=yellow]— My name is Zoe. I’ve heard some rumors about you around town... that you are a kind person. Please, excuse my uncle, he's concerned because he cares for the people and the clan, and with our region being remote we often get the feeling that there's very little to connect us to the Empire. \n\n— But I don't think attacking that spirit will solve anything. It might not even help the sick people. I'm sure if we just get rid of the spirit that area will become just like the other land around here or even die off. We can't sustain our population from hunting alone but nobody will listen to me. Let me come with you, I want to try to talk to that forest spirit and maybe we can find a better solution…\n\nYou consider the young girl's proposal, not sure if it would hurt or help the cause. Perhaps she could help find a solution that would be beneficial to both sides, and on the other hand if her uncle is willing to keep sending people to their deaths, you could still call off her uncle and recommend someone else take over leadership.",
        "MainQuestFrostfordCityhallZoeAccept": "[color=yellow]— Thank you so much! I'll follow you next time you go there. [/color]",
        "MainQuestFrostfordCityhallZoeRefuse": "Zoe looks disappointed at your refusal but it does not seem like she's surprised.",
        "MainQuestFrostfordCityhallReturn2": "Given Theron’s refusal to seek a less destructive solution and one that might benefit his people, you can report to the Mage's guild that he's unsuitable to rule Frostford and should be replaced. In the end it would complete your mission.",
        "MainQuestFrostfordCityhallFireTheron": "You send a message to the Mages Order explaining the situation. After a couple of hours you receive a letter in reply informing you that the matter will be resolved by the next day. You figure it's better to wait in Frostford incase there is further need for you...",
        "MainQuestFrostfordCityhallFireTheron2": "The next day you meet two of the Order's executives who are already taking care of a protesting Theron and preparing to elect a new clan leader. They pass you a message of gratitude, telling that your work there is done. ",
        "MainQuestFrostfordForestReturn": "If you are going to fight the spirit, it's better to make sure you are properly prepared. ",
        "MainQuestFrostfordForestFight": "You enter the ancient clearing which somehow looks even more unsettling than before. Without proceeding much further , you hear the familiar unemotional voice.\n\n[color=yellow]— If you are going to attack us we won't hold back. Prepare for your demise. [/color]",
        "MainQuestFrostfordForestWin": "While you were fighting the ethereal beings, the spirit appears to have escaped. Your party gives chase into the wilds but fails to catch the fleeing enemy. You have little reason to believe she’ll ever come back, so it’s time to report back to Theron",
        "MainQuestFrostfordForestWinReturn": "You find Theron to be in a more positive mood than usual. \n\n[color=yellow]— You've dealt with the spirit? It seems our hunters are getting better! We are indebted to you, $name. Oh, another thing, there's been an urgent message from the Order, so you should probably return there. If you get the chance, come visit us again. [/color]",
        "MainQuestFrostfordBeforeForestZoe": "Zoe awkwardly follows you through the wilds having to take occasional breaks to allow her to recover. She seems to have little experience travelling through nature and often stumbles and nearly trips over branches and other obstacles . Despite this her mood is quite optimistic.\n\n[color=yellow]— I want to thank you again for giving me a chance. Nobody from the clan will listen to or trust me. My father is deceased and with that it leaves me as nothing more than a bargaining tool for someone's arranged marriage at best, can't even leave on my own. I've tried to study and help with the town's issues but they won't accept what some “ignorant girl” would say. This way I can at least try to prove my worth... if they don't get too angry at me for escaping. [/color]\n\nFrom what Zoe tells you, it seems that her clan has a very strong hierarchy and the chosen leaders and their close relatives are held in a higher respect. On top of that, women rarely take any leadership roles and thus are often overlooked in that regard. You explain to her how things function in other places. She listens intently with a spark in her eyes. As the talk goes on you quickly find yourself closing in on your destination.",
        "MainQuestFrostfordForestReturnWithZoe": "Shortly after you approach the clearing with Zoe, the forest spirit shows up with a mild look of curiosity on its face. Zoe asks if you will let her talk to it, and after thinking for a moment you give her permission. After taking a couple of steps forward, she drops on her knees and begs to the spirit. \n\n[color=yellow]— We are greatly sorry for trespassing and attacking your creatures. If your majesty would allow this, I want to discuss our problematic situation. [/color]\n\nAfter a couple more sentences showing Zoe's skills at negotiations and etiquette, the spirit stops her.\n\n[color=aqua]— I might accept your apology, but if I find your words shallow, I'll execute you. If you agree to this, come join me. [/color]\n\nZoe gives you a worried look, but ultimately agrees and before disappearing into the bushes tells you to wait for her.",
        "MainQuestFrostfordForestReturnWithZoe2": "After a few hours of waiting, both the spirit and an unharmed Zoe return to you and the wolfgirl explains the situation.\n\n[color=yellow]— We have reached an agreement. With the spirit's powers we will try to grow new crops, suitable for our lands. I will have to stay here and would ask you to do two things. Firstly, please explain to my uncle that there's no need to worry and that they shouldn't attack this place. I also promised to provide help if something bad happens here. Secondly, we will need some ingredients, I hope you could get them for us. Here's the list, until then we will be waiting for your return. [/color]\n\nWeighing Zoe's words you decide that there's no better solution than to play along for now, and leave.",
        "MainQuestFrostfordTheronZoeReturn": "You deliver the news to Theron, who seems to be displeased to the verge of raging, which seems to stem from you not quite doing what he expected. \n\n[color=yellow]— I’ll teach that girl once she's back... Fine, I get it, but you better bring her with you next time. What else was it that you wanted? Her herbal bag? You can have it, fine. Now I have to get back to business, if you excuse me, I don't have all day to deal with delusional teens and spirit taming. [/color]",
        "MainQuestFrostfordForestReturnZoeEmpty": "You don't have everything required for Zoe.",
        "MainQuestFrostfordForestReturnZoe": "You enter the familiar clearing and meet with Zoe, who's alone this time. \n\n[color=yellow]— You brought everything? That's great! Now hold on for a moment, I'll be right back…[/color]\n\nShe takes the requested items and quickly disappears. A few minutes later she shows up with the spirit next to her when suddenly a group of humans, armed and dressed as mercenaries burst forth from the path you arrived by. A few of them carry torches and flaming bottles which quickly fly into the nearby trees, setting them on fire. \n\n[color=aqua]— This is the monster Hade ordered us to kill, guys. Good thing we followed that mage here. None shall escape![/color]\n\nAs the group of about 15 opponents come charging at you, you have no choice but to fight.",
        "MainQuestFrostfordForestReturnZoeWin": "As your party defeats a large portion of the enemy group, one you notice too late aims a crossbow and fires a bolt at the spirit . Normal weapons doubtedly would harm a creature of this caliber, but from the look of it, it is at the very least imbued with magic and most likely a poison. Just before the bolt reaches its target, Zoe, who spotted this slightly earlier than you, jumps in its way. \n\nQuickly dispatching the remaining enemies and putting out the fire, you rush to the spirit, who holds Zoes still breathing body. The bolt has plunged deeply into her chest and it's doubtful she would live for more than few hours even if it was just a common weapon. Zoe, getting paler by the moment, does not even seem to have any strength to talk and looks up at you with fear in her eyes.\n\n[color=yellow]— A mighty venom. It takes a lot just to keep her conscious. You might try to save her, if you are brave enough. By using another person's life essence we can attempt to keep her alive while she recovers, but there's very little chance for them to survive the process. In the worst case they both will die. So, what do you say, mage?[/color]",
        "MainQuestFrostfordZoeSelf": "You decide that since you brought this girl and and lead those bandits here, it's your duty to risk your own life to try save her. The Spirit does not seem to be bothered too much, but you notice a gleam in her eyes. \n\nDespite the intense pain and fear coursing through your body, you hold up pretty well and eventually Zoe recovers. You feel terribly drained and sleepy, but with some help from your party you manage to stay on your feet with an amazed Zoe at your side. ",
        "MainQuestFrostfordZoeDie": "The Spirit silently accepts your decision while Zoe does not show any reaction, as if already accepting her death. After Zoe passes, you have no other choice but to leave this place.",
        "MainQuestFrostfordZoeWeak": "$name obediently obeys your order and entrusts $his life to the spirit. After a few minutes the procedure yields no results and both show no signs of life. You have no other choice but to leave this place. ",
        "MainQuestFrostfordZoeMed": "$name obediently obeys your order and entrusts $his life to the spirit. After a few minutes Zoe seems to recover, but $name has not made it and gave $his life in the process. Zoe looks at you with doubt, but accepts what has happened and after some rest returns to her original plan.",
        "MainQuestFrostfordZoeStrong": "$name obediently obeys your order and entrusts $his life to the spirit. After a few minutes Zoe seems to recover. To everyone's surprise, $name manages to pull through as well, albeit heavily exhausted and barely moving. Everyone seems to be very relieved with this outcome and soon Zoe returns to her original plan.",
        "MainQuestFrostfordZoeHostage": "You decide to interrogate one of the men you hold hostage and see if he will reveal what the hell was going on.\n\n[color=yellow]— Fuck off, mage. We came here to get rid of these monsters and half-humans. Hade will destroy you for this, if you live long enough. Their heads might have been worth a pretty penny from him, but none of this will matter soon, hah. [/color]\n\nYou attempt to get more information from the mercenary, but it proves to be a futile endeavour: a spell seems to be preventing him from saying too much and there's nothing you can do but deliver them to the law.",
        "MainQuestFrostfordZoeAlive": "After some more time Zoe finally proclaims that with some adjustments they have been able to produce some new crops, which should be ideal for Frostford's climate and soil conditions. Grabbing her possessions she thanks the spirit and says she is ready to travel back with you.",
        "MainQuestFrostfordZoeAliveReturn": "After explaining the whole story and Zoe demonstrating her accomplishment, Theron reacts with high spirit. \n\n[color=yellow]— This might be a new step for Frostford, $name. We are indebted to you. Let's hope your work will be just what we need. Your mission is over, but we would be happy to see you again, so visit us when you can, northern booze is our honor!\n\n— And about you Zoe... You have done well and your work apparently has been very valuable to $name. However, you left the clan's home without any notice and were risking your life for no good reason. This has to be punished. Henceforth you are expelled from the clan. You are no longer part of the household and will have to move out. [/color]\n\nAs you were about to protest, you notice how Zoe's can barely hold back from smiling at this news. You realize, that this 'punishment' is a way for Theron to release her from ties holding her here and will allow her to go her own way from now on. After a bow, she quickly leaves you two alone.\n\n[color=yellow]— Oh lastly,  an urgent message arrived from the Mage's Guild this morning for you. Perhaps you should return there. [/color]\n\nAfter shaking hands you leave the room. On your way out of the building you run into Zoe again, who almost finished packing her belongings and getting her salary from the clan, preparing to leave too. \n\n[color=aqua]— Thank you again, $name. Don't worry about this, I have been hoping to be able to leave for a long time now, although, I'm not sure where to go... [/color]",
        "MainQuestFrostfordZoeDeadReturn": "After explaining the whole story and begging pardon for his niece's death, Theron trembles in rage but manages to holds himself in control, indicating his competence as a leader. \n\n[color=yellow]— I should've known it. I don't want to see you here anymore, mage! We will take care of this on our own, report to your superiors and tell them that I withdraw my request.  [/color]\n\nYou decide to not test your luck any further and quickly retreat from Theron’s quarters. On your way out someone passes you a message from the Mage’s Order indicating an urgent matter of some sort. Perhaps you should return to Wimborn. ",
        "MainQuestFrostfordZoeJoin": "After hearing your offer Zoe takes only a few moments to accept. \n\n[color=yellow]— I can't turn down someone who saved my life, can I? Just please, no arranged marriages. [/color]",
        "MainQuestFrostfordZoeLeave": "You wish Zoe the best on her travels and she soon disappears into the crowd. "
    },
    "finaleQuestTexts": {
        "MainQuestFinaleStart": "Your morning is interrupted by a messenger from Melissa requesting you to meet her at The Order as soon as you are free. ",
        "MainQuestFinaleOrder": "[color=yellow]— Nice to see you, $name. Hopefully your recent business in Frostford hasn't chilled you too much. I've just received an urgent message from Gorn. It seems Garthor has given us some new troubles to deal with. He said something about terrorists or rebels of some sort. Anyway, since you helped him last time, it would be best if you go again. Oh, and it's probably better to keep The Order’s main branch in the dark about this, unless things get really out of hand. We wouldn’t want our credibility to suffer, would we?\n\n— Well, then. I'll let Garthor know you shall be arriving soon. I'm sure it’s nothing you won't be able to handle. Once you return contact me as soon as possible.[/color]",
        "MainQuestFinaleGorn": "You find Garthor in the main meeting room. Judging from his reaction, he puts a decent amount of faith in you.\n\n[color=yellow]— Greetings, $name. Apparently our previous operation wasn't a complete success; despite the absence of their leader, considerable number of Kel'tor's clan went into hiding and have been engaging in guerilla warfare against our forces. They weren't making much headway for quite some time, but they’ve grown more experienced at ambushing our guards and attacking our posts. I only called you, however, to help resolve a specific problem. Ayda has been kidnapped, and I have good reason to believe it was their work. I need you to locate her. As she's likely being kept in their hideout, you’ll be able to kill two birds with one stone and exterminate them for their audacity. \n\n— To begin, I suggest you meet with the last person who saw her, her assistant. The small beastkin might be able to offer some clues as to her whereabouts. As far as I know, he should still be around her shop. Carry on. [/color]",
        "MainQuestFinaleAydaShop": "You find Ayda's assistant, a beastkin bunny named Gin, in a pretty despondent state. He perks up a bit during your questioning and reveals to you the details of last night’s break-in. A group of people quickly took Ayda away, while he managed to hide inside one of the alchemy racks. Because it was so dark, he couldn't say much of anything about the kidnappers. He did reveal, however, that their build resembled humans, rather than orcs or goblins. \n\nSearching through the shop yields no significant results. Disappointed with your findings, you prepare to leave.Just before you exit the building Gin meekly calls out to you and hands over a small vial. \n\n[color=yellow]— Master told me, if anything happened this might prove useful...[/color]\n\nUpon closer inspection, you realize this is likely a vial of Ayda's blood with a significant amount of rare magic essence mixed in it. Blood is a difficult medium to work with directly, but it seems the elven alchemist has managed to do something exceptional once again. After promising the bunny boy that you’ll bring back his master, you leave the shop and begin your search.\n\nAfter attuning yourself to the vial's contents, you feel Ayda's presence to the North - in the direction of the mountainous region. Lacking any better options, you decide to venture in that direction.",
        "MainQuestFinaleMountainCave": "As you work your way through one of the hidden tunnels, a threatening voice stops you in your tracks. \n\n[color=yellow]— One more move and you'll find your head on the cave floor![/color]\n\nThe male leader is followed by a pair of armored dark elves, seemingly guarding some sort of reinforced underground hideout. You ponder why their clothing looks familiar until you recognize the familiar Kel'tor clan’s pattern on their shoulders. Your intuition tells you that you've come to the right place and that Ayda is likely still around. You decide to ask the Kel’tor about her, in order to confirm your suspicions. \n\nTheir leader explains that Irvan was kidnapped and that those that remained of their clan began to be hunted down by local slave groups. Some members gathered here to fight back and attempt to discover what had happened to Irvan. They decided to kidnap Ayda, believing she had some connection to Irvan’s disappearance. \n\nAs soon as you are ready to attempt negotiations, you hear a loud noise from behind - a large group of armed mercenaries. They appear to be the slavers' mercenaries, having tracked you all the way to the elves' hideout. \n\n[color=yellow]— Nice work, mage. Let's get this over with and kill the bloody bastards. [/color]\n\nTo your surprise, the elf leader addresses you after quickly analyzing the situation.\n\n[color=yellow]— Damn it! If you want your friend back, you had better help us fight here, or we’ll take her down with us![/color]",
        "MainQuestFinaleElfWin": "Your triumph over the slavers secured Ayda's safety and you follow a few of the escapees to an adjacent passage in order to gauge the situation. Just as you enter a vast backlit cave, a few escapees form into a new group led by a hooded figure. As he spots your approach, he drops his hood to face you in person. A young man with a stern, powerful look stands to address you.",
        "MainQuestFinaleMercWin": "After you strike down the last elf, you search their hideout for Ayda. Unfortunately, the leader kept his word and you find her lifeless corpse in one of the holding cells. Saddened by this turn of events, you prepare to leave; however, the remnants of the mercenaries gather around and block your passage. To your surprise, from behind them comes a hooded figure. He unveils his face and a young man with a stern, powerful look stands to address you.",
        "MainQuestFinaleHadeSpeech": "[color=yellow]— Greetings, $name. I'm Hade. I believe you've already heard of me, and it's a great time for us to meet. You've been worryingly resourceful all the time I've observed you and quite capable right to the end. Yes, I've been observing you quite some time - since the moment you joined The Order, in fact. Tell me, don't you think you deserve more than being just an errand $child carrying out meticulous tasks for the higher-ups? Don't you want to have more power over the world around you? [/color]",
        "MainQuestFinaleHadeSpeechHuman": "[color=yellow]— A fellow human like yourself should understand me well; we are the pinnacle of progress. Humans are the race that founded and holds the most power in The Order. Why, then, do we allow these brutes to delight in our achievements? How is it permissible for them to keep humans as slaves? We have won the war, yet elves have the audacity to openly oppose us in daily life. There's no reason to permit the lesser races to rule over others. We could even free human slaves and let others take their places at menial tasks. But my proposals were shunned by The Order.[/color]",
        "MainQuestFinaleHadeSpeechAdditional": "[color=yellow]As you can see, we both know what we want. We can only achieve greater goals together!\n\n— If it so happens that you doubt our power, I'll inform you now. These you see before you are not the extent of my followers. You, surely, have encountered some of them; we control many members of The Order’s current leadership. Though it might not be obvious, there are plenty of members who share my grievances. And our goals can be achieved without disrupting the lives of the common folk. In fact, your help to Garthor was very convenient and allowed me to test you early on in your journey. Yes, he's just one of many. Even you played an important role, albeit unknowingly. \n\n— So make your choice, [color=aqua]$name[/color], are you willing to join our revolution, or will you stick to the old decaying regime?[/color]"
    },
    "hadesSpeechTexts": {
        "MainQuestFinaleGoodChoice": "[color=yellow]— That's a shame. Well, I'll have to initiate my plan now, so have a quiet rest.[/color]\n\nAs Hade finishes his sentence, he quickly withdraws and the earth starts shaking. Before you can react, the ceiling crashes down behind him, blocking your pursuit. \n\nLuckily, you’re able to find your way back to the passage where you entered. ",
        "MainQuestFinaleGoodGarthor": "It seems that’s the extent of your luck, however, as your way is blocked by a group of armed orcs led by Garthor. \n\n[color=yellow]— Honestly, I’m surprised you survived. I'm sorry, but Hade ordered to finish you off in case that happens. We can't let you interfere now. \n\n— It's a shame things have to end this way after all the work you did.[/color]\n\nGarthor and the others unsheathe their weapons, preparing for battle.",
        "MainQuestFinaleGoodChoiceWin": "Shocked and embittered by your victory, Garthor surrenders. \n\n[color=yellow]— You can kill me, but Hade has already won. This whole affair was setup to draw attention away from the main headquarters. Kill me if you want, I’ve finished my part either way. It makes no difference, just another obstacle to waste your time.[/color]",
        "MainQuestFinaleGoodChoiceKillGarthor": "You quickly dispatch the traitors and continue on your way. ",
        "MainQuestFinaleGoodChoiceLeaveGarthor": "You strip Garthor and his orcs of their equipment and toss them over a cliff before continuing on your way.",
        "MainQuestFinaleGoodWimborn": "You burst into The Mage’s Order’s local branch and take a quick look around, but Melissa is nowhere to be found. People report some unusual commotion going on at the main headquarters and, despite their multiple warnings, you rush through the portal while it’s still functioning.",
        "MainQuestFinaleGoodMainOrder": "As the teleportation finishes, you meet with an unexpected sight - the floor of the room is littered with unconscious or injured Mages.. You hear sounds of combat upstairs and rush up to help. The halls are mostly occupied by Hade's followers fighting back forces coming from other regions. Other groups are either shutting down still functioning portals to prevent new teleportations or gathering unconscious bodies in secured rooms. You realize there's little point in waiting for backup and rush into the council room. ",
        "MainQuestFinaleGoodHade": "As you enter, you notice Hade, along with a small group of masked followers, already present inside. Several council members are bound in the corner, barely moving. \n\n[color=yellow]— You know, you could've easily avoided all this and I might've ignored your existence for quite some time, given the amount of power and connections you have. It was quite stupid of you to rush in here on your own; The Order can’t be of any help to you now. But of course, you’ve come to fight. Fine, I'll grant you your last moments. Consider it my gratitude for your invaluable help. [/color]",
        "MainQuestFinaleGoodHadeDefeat": "Hade kneels before you in defeat, but before you are able to claim victory, a familiar voice calls out from behind, stopping you. As you turn around, you see Melissa holding [color=aqua]$name[/color], bound in ropes with a dagger held against $his neck. \n\nThe dagger seems to be enchanted with powerful magic, leaving no doubt that it would deliver a fatal wound.\n\n[color=yellow]— Stop now, $playername! We may not have lost had I come sooner, but I suppose there's no point regretting things now. I propose a trade: your slave's life for my brother's freedom. This battle is already lost. I promise we won’t oppose The Order or yourself again, if you let us leave. [/color]\n\nYou look to Hade, but he seems too shaken up by his defeat to respond.",
        "MainQuestFinaleGoodReleaseHade": "You nod and release Hade, who silently skulks to Melissa's side. She passes him a teleportation seal and Hade forces himself to look up at you one last time before disappearing into thin air. \n\n[color=yellow]— He should have apologised to those who've chosen to support us, at least. It's quite ironic how my personal subordinate unraveled our plans and undid years of my work.",
        "MainQuestFinaleGoodReleaseHade2": "[color=yellow]— One more thing... here are the notes from some of our sponsors. Even though they technically were our allies, I would not be opposed to anyone bringing them down. Sometimes, life forces you into very unusual alliances after all. \n\n— I'm sorry for manipulating you, $playername, not that it matters anymore. [/color]\n\nMelissa disappears in the same manner as Hade, leaving a small piece of paper behind. Losing $his support, $name drops to the floor. ",
        "MainQuestFinaleGoodTakeHade": "Instead of replying you dash towards Melissa, but your speed is not enough to stop her dagger from slitting $name's throat. You quickly subdue Melissa, but $name shows no signs of life, lying surrounded in a pool of blood. Despite what she’d just done, Melissa's face shows a hint of regret. \n\n[color=yellow]— This was your choice. I hope $he's in a better world than this one. [/color]",
        "MainQuestFinaleBadAccept": "[color=yellow]— Excellent! Then let's not waste any time, as the preparations are nearly complete. Proceed to Wimborn.From there, make your way to The Order’s main branch before sunset. Oh yes, just one more little thing. In case you drop in too soon, use this mixture on yourself and your team, it will make you immune to our special weapon. I'll meet you there.[/color]\n\nWith this, Hade's party use their teleportation seals and vanish. ",
        "MainQuestFinaleBadDavid": "The previously met investigator David and a couple of his subordinates seem to be aware of the plan and block your way. \n\n[color=yellow]— You are under arrest, $name. Don't try to resist and surrender immediately. [/color]\n\nThere's no going back now and you unsheathe your weapons. ",
        "MainQuestFinaleBadWin": "As David is defeated, you realize you are getting out of time to return to Wimborn. ",
        "MainQuestFinaleBadWimborn": "After returning to Wimborn you take a brief rest and head to The Mage's Order. Melissa seems to be absent from her usual post. After using the mixture given to you by Hade, you transport to The Order’s headquarters.",
        "MainQuestFinaleBadOrder": "You don't immediately recognize the location you teleported into; unlike before, there are signs of battle and bodies litter the floor. Most of The Order's mages seem to be unconscious or defeated and Hade's allies secure the hallways and entrances. One of them spots you and tells you to hurry upstairs to the council room. \n\nAt the entrance to the council floor you find Hade with an uncanny smile on his face.\n\n[color=yellow]— So you came right in time. Your effort getting those schematics paid out quite well. It was originally designed to knock out regular magic users, as our bodies are in resonance with the raw energy we use. It took us quite some time to recreate and fine-tune it, but it ended up being our trump card. Once we take care of the remaining forces, we can declare our victory.\n\n— Now, I believe the council chambers have yet to be taken. I want you to prove your worth by dealing with them.[/color]",
        "MainQuestFinaleBadOrder2": "In the final council room you see a couple of soldiers protecting weakened council remnants which you can recognize from before the Frostford's mission. The old man who you've seen before, addresses you. \n\n[color=yellow]— $name... so you are responsible for this as well. Don't think we will go down easily. [/color]",
        "MainQuestFinaleBadOrderWin": "Hade enters the room with a huge smile on his face. After observing your deeds, he makes an announcement. \n\n[color=yellow]— Splendid! This is the start of a new era for Humanity. [/color]"
    }
}